7h3qu1rkyb1t/stm32f7-drivers/drivers/inc/stm32f767xx_USB_OTG_HS.h
#define Set_OTG_HS_HOST_OTG_HS_HCSPLT5(FLAG) (*(uint32_t*)0x400405a4 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCSPLT5(FLAG) (*(uint32_t*)0x400405a4 &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCSPLT6(FLAG) (*(uint32_t*)0x400405c4 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCSPLT6(FLAG) (*(uint32_t*)0x400405c4 &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCSPLT7(FLAG) (*(uint32_t*)0x400405e4 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCSPLT7(FLAG) (*(uint32_t*)0x400405e4 &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCSPLT8(FLAG) (*(uint32_t*)0x40040604 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCSPLT8(FLAG) (*(uint32_t*)0x40040604 &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCSPLT9(FLAG) (*(uint32_t*)0x40040624 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCSPLT9(FLAG) (*(uint32_t*)0x40040624 &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCSPLT10(FLAG)(*(uint32_t*)0x40040644 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCSPLT10(FLAG)(*(uint32_t*)0x40040644 &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCSPLT11(FLAG)(*(uint32_t*)0x40040664 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCSPLT11(FLAG)(*(uint32_t*)0x40040664 &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCINT0(FLAG)  (*(uint32_t*)0x40040508 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCINT0(FLAG)  (*(uint32_t*)0x40040508 &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCINT1(FLAG)  (*(uint32_t*)0x40040528 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCINT1(FLAG)  (*(uint32_t*)0x40040528 &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCINT2(FLAG)  (*(uint32_t*)0x40040548 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCINT2(FLAG)  (*(uint32_t*)0x40040548 &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCINT3(FLAG)  (*(uint32_t*)0x40040568 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCINT3(FLAG)  (*(uint32_t*)0x40040568 &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCINT4(FLAG)  (*(uint32_t*)0x40040588 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCINT4(FLAG)  (*(uint32_t*)0x40040588 &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCINT5(FLAG)  (*(uint32_t*)0x400405a8 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCINT5(FLAG)  (*(uint32_t*)0x400405a8 &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCINT6(FLAG)  (*(uint32_t*)0x400405c8 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCINT6(FLAG)  (*(uint32_t*)0x400405c8 &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCINT7(FLAG)  (*(uint32_t*)0x400405e8 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCINT7(FLAG)  (*(uint32_t*)0x400405e8 &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCINT8(FLAG)  (*(uint32_t*)0x40040608 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCINT8(FLAG)  (*(uint32_t*)0x40040608 &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCINT9(FLAG)  (*(uint32_t*)0x40040628 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCINT9(FLAG)  (*(uint32_t*)0x40040628 &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCINT10(FLAG) (*(uint32_t*)0x40040648 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCINT10(FLAG) (*(uint32_t*)0x40040648 &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCINT11(FLAG) (*(uint32_t*)0x40040668 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCINT11(FLAG) (*(uint32_t*)0x40040668 &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCINTMSK0(FLAG)(*(uint32_t*)0x4004050c |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCINTMSK0(FLAG)(*(uint32_t*)0x4004050c &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCINTMSK1(FLAG)(*(uint32_t*)0x4004052c |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCINTMSK1(FLAG)(*(uint32_t*)0x4004052c &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCINTMSK2(FLAG)(*(uint32_t*)0x4004054c |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCINTMSK2(FLAG)(*(uint32_t*)0x4004054c &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCINTMSK3(FLAG)(*(uint32_t*)0x4004056c |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCINTMSK3(FLAG)(*(uint32_t*)0x4004056c &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCINTMSK4(FLAG)(*(uint32_t*)0x4004058c |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCINTMSK4(FLAG)(*(uint32_t*)0x4004058c &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCINTMSK5(FLAG)(*(uint32_t*)0x400405ac |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCINTMSK5(FLAG)(*(uint32_t*)0x400405ac &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCINTMSK6(FLAG)(*(uint32_t*)0x400405cc |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCINTMSK6(FLAG)(*(uint32_t*)0x400405cc &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCINTMSK7(FLAG)(*(uint32_t*)0x400405ec |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCINTMSK7(FLAG)(*(uint32_t*)0x400405ec &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCINTMSK8(FLAG)(*(uint32_t*)0x4004060c |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCINTMSK8(FLAG)(*(uint32_t*)0x4004060c &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCINTMSK9(FLAG)(*(uint32_t*)0x4004062c |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCINTMSK9(FLAG)(*(uint32_t*)0x4004062c &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCINTMSK10(FLAG)(*(uint32_t*)0x4004064c |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCINTMSK10(FLAG)(*(uint32_t*)0x4004064c &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCINTMSK11(FLAG)(*(uint32_t*)0x4004066c |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCINTMSK11(FLAG)(*(uint32_t*)0x4004066c &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCTSIZ0(FLAG) (*(uint32_t*)0x40040510 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCTSIZ0(FLAG) (*(uint32_t*)0x40040510 &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCTSIZ1(FLAG) (*(uint32_t*)0x40040530 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCTSIZ1(FLAG) (*(uint32_t*)0x40040530 &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCTSIZ2(FLAG) (*(uint32_t*)0x40040550 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCTSIZ2(FLAG) (*(uint32_t*)0x40040550 &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCTSIZ3(FLAG) (*(uint32_t*)0x40040570 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCTSIZ3(FLAG) (*(uint32_t*)0x40040570 &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCTSIZ4(FLAG) (*(uint32_t*)0x40040590 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCTSIZ4(FLAG) (*(uint32_t*)0x40040590 &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCTSIZ5(FLAG) (*(uint32_t*)0x400405b0 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCTSIZ5(FLAG) (*(uint32_t*)0x400405b0 &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCTSIZ6(FLAG) (*(uint32_t*)0x400405d0 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCTSIZ6(FLAG) (*(uint32_t*)0x400405d0 &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCTSIZ7(FLAG) (*(uint32_t*)0x400405f0 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCTSIZ7(FLAG) (*(uint32_t*)0x400405f0 &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCTSIZ8(FLAG) (*(uint32_t*)0x40040610 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCTSIZ8(FLAG) (*(uint32_t*)0x40040610 &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCTSIZ9(FLAG) (*(uint32_t*)0x40040630 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCTSIZ9(FLAG) (*(uint32_t*)0x40040630 &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCTSIZ10(FLAG)(*(uint32_t*)0x40040650 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCTSIZ10(FLAG)(*(uint32_t*)0x40040650 &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCTSIZ11(FLAG)(*(uint32_t*)0x40040670 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCTSIZ11(FLAG)(*(uint32_t*)0x40040670 &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCDMA0(FLAG)  (*(uint32_t*)0x40040514 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCDMA0(FLAG)  (*(uint32_t*)0x40040514 &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCDMA1(FLAG)  (*(uint32_t*)0x40040534 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCDMA1(FLAG)  (*(uint32_t*)0x40040534 &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCDMA2(FLAG)  (*(uint32_t*)0x40040554 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCDMA2(FLAG)  (*(uint32_t*)0x40040554 &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCDMA3(FLAG)  (*(uint32_t*)0x40040574 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCDMA3(FLAG)  (*(uint32_t*)0x40040574 &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCDMA4(FLAG)  (*(uint32_t*)0x40040594 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCDMA4(FLAG)  (*(uint32_t*)0x40040594 &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCDMA5(FLAG)  (*(uint32_t*)0x400405b4 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCDMA5(FLAG)  (*(uint32_t*)0x400405b4 &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCDMA6(FLAG)  (*(uint32_t*)0x400405d4 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCDMA6(FLAG)  (*(uint32_t*)0x400405d4 &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCDMA7(FLAG)  (*(uint32_t*)0x400405f4 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCDMA7(FLAG)  (*(uint32_t*)0x400405f4 &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCDMA8(FLAG)  (*(uint32_t*)0x40040614 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCDMA8(FLAG)  (*(uint32_t*)0x40040614 &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCDMA9(FLAG)  (*(uint32_t*)0x40040634 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCDMA9(FLAG)  (*(uint32_t*)0x40040634 &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCDMA10(FLAG) (*(uint32_t*)0x40040654 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCDMA10(FLAG) (*(uint32_t*)0x40040654 &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCDMA11(FLAG) (*(uint32_t*)0x40040674 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCDMA11(FLAG) (*(uint32_t*)0x40040674 &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCCHAR12(FLAG)(*(uint32_t*)0x40040678 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCCHAR12(FLAG)(*(uint32_t*)0x40040678 &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCSPLT12(FLAG)(*(uint32_t*)0x4004067c |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCSPLT12(FLAG)(*(uint32_t*)0x4004067c &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCINT12(FLAG) (*(uint32_t*)0x40040680 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCINT12(FLAG) (*(uint32_t*)0x40040680 &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCINTMSK12(FLAG)(*(uint32_t*)0x40040684 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCINTMSK12(FLAG)(*(uint32_t*)0x40040684 &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCTSIZ12(FLAG)(*(uint32_t*)0x40040688 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCTSIZ12(FLAG)(*(uint32_t*)0x40040688 &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCDMA12(FLAG) (*(uint32_t*)0x4004068c |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCDMA12(FLAG) (*(uint32_t*)0x4004068c &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCCHAR13(FLAG)(*(uint32_t*)0x40040690 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCCHAR13(FLAG)(*(uint32_t*)0x40040690 &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCSPLT13(FLAG)(*(uint32_t*)0x40040694 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCSPLT13(FLAG)(*(uint32_t*)0x40040694 &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCINT13(FLAG) (*(uint32_t*)0x40040698 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCINT13(FLAG) (*(uint32_t*)0x40040698 &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCINTMSK13(FLAG)(*(uint32_t*)0x4004069c |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCINTMSK13(FLAG)(*(uint32_t*)0x4004069c &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCTSIZ13(FLAG)(*(uint32_t*)0x400406a0 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCTSIZ13(FLAG)(*(uint32_t*)0x400406a0 &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCDMA13(FLAG) (*(uint32_t*)0x400406a4 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCDMA13(FLAG) (*(uint32_t*)0x400406a4 &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCCHAR14(FLAG)(*(uint32_t*)0x400406a8 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCCHAR14(FLAG)(*(uint32_t*)0x400406a8 &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCSPLT14(FLAG)(*(uint32_t*)0x400406ac |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCSPLT14(FLAG)(*(uint32_t*)0x400406ac &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCINT14(FLAG) (*(uint32_t*)0x400406b0 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCINT14(FLAG) (*(uint32_t*)0x400406b0 &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCINTMSK14(FLAG)(*(uint32_t*)0x400406b4 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCINTMSK14(FLAG)(*(uint32_t*)0x400406b4 &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCTSIZ14(FLAG)(*(uint32_t*)0x400406b8 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCTSIZ14(FLAG)(*(uint32_t*)0x400406b8 &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCDMA14(FLAG) (*(uint32_t*)0x400406bc |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCDMA14(FLAG) (*(uint32_t*)0x400406bc &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCCHAR15(FLAG)(*(uint32_t*)0x400406c0 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCCHAR15(FLAG)(*(uint32_t*)0x400406c0 &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCSPLT15(FLAG)(*(uint32_t*)0x400406c4 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCSPLT15(FLAG)(*(uint32_t*)0x400406c4 &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCINT15(FLAG) (*(uint32_t*)0x400406c8 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCINT15(FLAG) (*(uint32_t*)0x400406c8 &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCINTMSK15(FLAG)(*(uint32_t*)0x400406cc |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCINTMSK15(FLAG)(*(uint32_t*)0x400406cc &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCTSIZ15(FLAG)(*(uint32_t*)0x400406d0 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCTSIZ15(FLAG)(*(uint32_t*)0x400406d0 &= ~FLAG)
#define Set_OTG_HS_HOST_OTG_HS_HCDMA15(FLAG) (*(uint32_t*)0x400406d4 |= FLAG)
#define Clr_OTG_HS_HOST_OTG_HS_HCDMA15(FLAG) (*(uint32_t*)0x400406d4 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DCFG(FLAG)  (*(uint32_t*)0x40040800 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DCFG(FLAG)  (*(uint32_t*)0x40040800 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DCTL(FLAG)  (*(uint32_t*)0x40040804 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DCTL(FLAG)  (*(uint32_t*)0x40040804 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DSTS(FLAG)  (*(uint32_t*)0x40040808 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DSTS(FLAG)  (*(uint32_t*)0x40040808 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DIEPMSK(FLAG)(*(uint32_t*)0x40040810 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DIEPMSK(FLAG)(*(uint32_t*)0x40040810 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DOEPMSK(FLAG)(*(uint32_t*)0x40040814 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DOEPMSK(FLAG)(*(uint32_t*)0x40040814 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DAINT(FLAG) (*(uint32_t*)0x40040818 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DAINT(FLAG) (*(uint32_t*)0x40040818 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DAINTMSK(FLAG)(*(uint32_t*)0x4004081c |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DAINTMSK(FLAG)(*(uint32_t*)0x4004081c &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DVBUSDIS(FLAG)(*(uint32_t*)0x40040828 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DVBUSDIS(FLAG)(*(uint32_t*)0x40040828 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DVBUSPULSE(FLAG)(*(uint32_t*)0x4004082c |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DVBUSPULSE(FLAG)(*(uint32_t*)0x4004082c &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DTHRCTL(FLAG)(*(uint32_t*)0x40040830 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DTHRCTL(FLAG)(*(uint32_t*)0x40040830 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DIEPEMPMSK(FLAG)(*(uint32_t*)0x40040834 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DIEPEMPMSK(FLAG)(*(uint32_t*)0x40040834 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DEACHINT(FLAG)(*(uint32_t*)0x40040838 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DEACHINT(FLAG)(*(uint32_t*)0x40040838 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DEACHINTMSK(FLAG)(*(uint32_t*)0x4004083c |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DEACHINTMSK(FLAG)(*(uint32_t*)0x4004083c &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DIEPCTL0(FLAG)(*(uint32_t*)0x40040900 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DIEPCTL0(FLAG)(*(uint32_t*)0x40040900 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DIEPCTL1(FLAG)(*(uint32_t*)0x40040920 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DIEPCTL1(FLAG)(*(uint32_t*)0x40040920 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DIEPCTL2(FLAG)(*(uint32_t*)0x40040940 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DIEPCTL2(FLAG)(*(uint32_t*)0x40040940 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DIEPCTL3(FLAG)(*(uint32_t*)0x40040960 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DIEPCTL3(FLAG)(*(uint32_t*)0x40040960 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DIEPCTL4(FLAG)(*(uint32_t*)0x40040980 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DIEPCTL4(FLAG)(*(uint32_t*)0x40040980 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DIEPCTL5(FLAG)(*(uint32_t*)0x400409a0 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DIEPCTL5(FLAG)(*(uint32_t*)0x400409a0 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DIEPCTL6(FLAG)(*(uint32_t*)0x400409c0 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DIEPCTL6(FLAG)(*(uint32_t*)0x400409c0 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DIEPCTL7(FLAG)(*(uint32_t*)0x400409e0 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DIEPCTL7(FLAG)(*(uint32_t*)0x400409e0 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DIEPINT0(FLAG)(*(uint32_t*)0x40040908 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DIEPINT0(FLAG)(*(uint32_t*)0x40040908 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DIEPINT1(FLAG)(*(uint32_t*)0x40040928 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DIEPINT1(FLAG)(*(uint32_t*)0x40040928 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DIEPINT2(FLAG)(*(uint32_t*)0x40040948 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DIEPINT2(FLAG)(*(uint32_t*)0x40040948 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DIEPINT3(FLAG)(*(uint32_t*)0x40040968 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DIEPINT3(FLAG)(*(uint32_t*)0x40040968 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DIEPINT4(FLAG)(*(uint32_t*)0x40040988 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DIEPINT4(FLAG)(*(uint32_t*)0x40040988 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DIEPINT5(FLAG)(*(uint32_t*)0x400409a8 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DIEPINT5(FLAG)(*(uint32_t*)0x400409a8 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DIEPINT6(FLAG)(*(uint32_t*)0x400409c8 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DIEPINT6(FLAG)(*(uint32_t*)0x400409c8 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DIEPINT7(FLAG)(*(uint32_t*)0x400409e8 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DIEPINT7(FLAG)(*(uint32_t*)0x400409e8 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DIEPTSIZ0(FLAG)(*(uint32_t*)0x40040910 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DIEPTSIZ0(FLAG)(*(uint32_t*)0x40040910 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DIEPDMA1(FLAG)(*(uint32_t*)0x40040914 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DIEPDMA1(FLAG)(*(uint32_t*)0x40040914 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DIEPDMA2(FLAG)(*(uint32_t*)0x40040934 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DIEPDMA2(FLAG)(*(uint32_t*)0x40040934 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DIEPDMA3(FLAG)(*(uint32_t*)0x40040954 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DIEPDMA3(FLAG)(*(uint32_t*)0x40040954 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DIEPDMA4(FLAG)(*(uint32_t*)0x40040974 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DIEPDMA4(FLAG)(*(uint32_t*)0x40040974 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DIEPDMA5(FLAG)(*(uint32_t*)0x40040994 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DIEPDMA5(FLAG)(*(uint32_t*)0x40040994 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DTXFSTS0(FLAG)(*(uint32_t*)0x40040918 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DTXFSTS0(FLAG)(*(uint32_t*)0x40040918 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DTXFSTS1(FLAG)(*(uint32_t*)0x40040938 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DTXFSTS1(FLAG)(*(uint32_t*)0x40040938 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DTXFSTS2(FLAG)(*(uint32_t*)0x40040958 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DTXFSTS2(FLAG)(*(uint32_t*)0x40040958 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DTXFSTS3(FLAG)(*(uint32_t*)0x40040978 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DTXFSTS3(FLAG)(*(uint32_t*)0x40040978 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DTXFSTS4(FLAG)(*(uint32_t*)0x40040998 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DTXFSTS4(FLAG)(*(uint32_t*)0x40040998 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DTXFSTS5(FLAG)(*(uint32_t*)0x400409b8 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DTXFSTS5(FLAG)(*(uint32_t*)0x400409b8 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DIEPTSIZ1(FLAG)(*(uint32_t*)0x40040930 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DIEPTSIZ1(FLAG)(*(uint32_t*)0x40040930 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DIEPTSIZ2(FLAG)(*(uint32_t*)0x40040950 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DIEPTSIZ2(FLAG)(*(uint32_t*)0x40040950 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DIEPTSIZ3(FLAG)(*(uint32_t*)0x40040970 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DIEPTSIZ3(FLAG)(*(uint32_t*)0x40040970 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DIEPTSIZ4(FLAG)(*(uint32_t*)0x40040990 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DIEPTSIZ4(FLAG)(*(uint32_t*)0x40040990 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DIEPTSIZ5(FLAG)(*(uint32_t*)0x400409b0 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DIEPTSIZ5(FLAG)(*(uint32_t*)0x400409b0 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DOEPCTL0(FLAG)(*(uint32_t*)0x40040b00 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DOEPCTL0(FLAG)(*(uint32_t*)0x40040b00 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DOEPCTL1(FLAG)(*(uint32_t*)0x40040b20 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DOEPCTL1(FLAG)(*(uint32_t*)0x40040b20 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DOEPCTL2(FLAG)(*(uint32_t*)0x40040b40 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DOEPCTL2(FLAG)(*(uint32_t*)0x40040b40 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DOEPCTL3(FLAG)(*(uint32_t*)0x40040b60 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DOEPCTL3(FLAG)(*(uint32_t*)0x40040b60 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DOEPINT0(FLAG)(*(uint32_t*)0x40040b08 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DOEPINT0(FLAG)(*(uint32_t*)0x40040b08 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DOEPINT1(FLAG)(*(uint32_t*)0x40040b28 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DOEPINT1(FLAG)(*(uint32_t*)0x40040b28 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DOEPINT2(FLAG)(*(uint32_t*)0x40040b48 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DOEPINT2(FLAG)(*(uint32_t*)0x40040b48 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DOEPINT3(FLAG)(*(uint32_t*)0x40040b68 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DOEPINT3(FLAG)(*(uint32_t*)0x40040b68 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DOEPINT4(FLAG)(*(uint32_t*)0x40040b88 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DOEPINT4(FLAG)(*(uint32_t*)0x40040b88 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DOEPINT5(FLAG)(*(uint32_t*)0x40040ba8 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DOEPINT5(FLAG)(*(uint32_t*)0x40040ba8 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DOEPINT6(FLAG)(*(uint32_t*)0x40040bc8 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DOEPINT6(FLAG)(*(uint32_t*)0x40040bc8 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DOEPINT7(FLAG)(*(uint32_t*)0x40040be8 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DOEPINT7(FLAG)(*(uint32_t*)0x40040be8 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DOEPTSIZ0(FLAG)(*(uint32_t*)0x40040b10 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DOEPTSIZ0(FLAG)(*(uint32_t*)0x40040b10 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DOEPTSIZ1(FLAG)(*(uint32_t*)0x40040b30 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DOEPTSIZ1(FLAG)(*(uint32_t*)0x40040b30 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DOEPTSIZ2(FLAG)(*(uint32_t*)0x40040b50 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DOEPTSIZ2(FLAG)(*(uint32_t*)0x40040b50 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DOEPTSIZ3(FLAG)(*(uint32_t*)0x40040b70 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DOEPTSIZ3(FLAG)(*(uint32_t*)0x40040b70 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DOEPTSIZ4(FLAG)(*(uint32_t*)0x40040b90 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DOEPTSIZ4(FLAG)(*(uint32_t*)0x40040b90 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DIEPTSIZ6(FLAG)(*(uint32_t*)0x400409a0 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DIEPTSIZ6(FLAG)(*(uint32_t*)0x400409a0 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DTXFSTS6(FLAG)(*(uint32_t*)0x400409a4 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DTXFSTS6(FLAG)(*(uint32_t*)0x400409a4 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DIEPTSIZ7(FLAG)(*(uint32_t*)0x400409a8 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DIEPTSIZ7(FLAG)(*(uint32_t*)0x400409a8 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DTXFSTS7(FLAG)(*(uint32_t*)0x400409ac |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DTXFSTS7(FLAG)(*(uint32_t*)0x400409ac &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DOEPCTL4(FLAG)(*(uint32_t*)0x40040b80 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DOEPCTL4(FLAG)(*(uint32_t*)0x40040b80 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DOEPCTL5(FLAG)(*(uint32_t*)0x40040ba0 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DOEPCTL5(FLAG)(*(uint32_t*)0x40040ba0 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DOEPCTL6(FLAG)(*(uint32_t*)0x40040bc0 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DOEPCTL6(FLAG)(*(uint32_t*)0x40040bc0 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DOEPCTL7(FLAG)(*(uint32_t*)0x40040be0 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DOEPCTL7(FLAG)(*(uint32_t*)0x40040be0 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DOEPTSIZ5(FLAG)(*(uint32_t*)0x40040bb0 |= FLAG)
