7h3qu1rkyb1t/stm32f7-drivers/drivers/inc/stm32f767xx_USB_OTG_HS.h
#define Clr_OTG_HS_DEVICE_OTG_HS_DOEPTSIZ5(FLAG)(*(uint32_t*)0x40040bb0 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DOEPTSIZ6(FLAG)(*(uint32_t*)0x40040bd0 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DOEPTSIZ6(FLAG)(*(uint32_t*)0x40040bd0 &= ~FLAG)
#define Set_OTG_HS_DEVICE_OTG_HS_DOEPTSIZ7(FLAG)(*(uint32_t*)0x40040bf0 |= FLAG)
#define Clr_OTG_HS_DEVICE_OTG_HS_DOEPTSIZ7(FLAG)(*(uint32_t*)0x40040bf0 &= ~FLAG)
#define Set_OTG_HS_PWRCLK_OTG_HS_PCGCR(FLAG) (*(uint32_t*)0x40040e00 |= FLAG)
#define Clr_OTG_HS_PWRCLK_OTG_HS_PCGCR(FLAG) (*(uint32_t*)0x40040e00 &= ~FLAG)
#define  _OTG_HS_GLOBAL_OTG_HS_GOTGCTL_SRQSCS                (0x1 << 0)    // Session request success
#define  _OTG_HS_GLOBAL_OTG_HS_GOTGCTL_SRQ                   (0x1 << 1)    // Session request
#define  _OTG_HS_GLOBAL_OTG_HS_GOTGCTL_HNGSCS                (0x1 << 8)    // Host negotiation success
#define  _OTG_HS_GLOBAL_OTG_HS_GOTGCTL_HNPRQ                 (0x1 << 9)    // HNP request
#define  _OTG_HS_GLOBAL_OTG_HS_GOTGCTL_HSHNPEN               (0x1 << 10)    // Host set HNP enable
#define  _OTG_HS_GLOBAL_OTG_HS_GOTGCTL_DHNPEN                (0x1 << 11)    // Device HNP enabled
#define  _OTG_HS_GLOBAL_OTG_HS_GOTGCTL_CIDSTS                (0x1 << 16)    // Connector ID status
#define  _OTG_HS_GLOBAL_OTG_HS_GOTGCTL_DBCT                  (0x1 << 17)    // Long/short debounce time
#define  _OTG_HS_GLOBAL_OTG_HS_GOTGCTL_ASVLD                 (0x1 << 18)    // A-session valid
#define  _OTG_HS_GLOBAL_OTG_HS_GOTGCTL_BSVLD                 (0x1 << 19)    // B-session valid
#define  _OTG_HS_GLOBAL_OTG_HS_GOTGCTL_EHEN                  (0x1 << 12)    // Embedded host enable
#define  _OTG_HS_GLOBAL_OTG_HS_GOTGINT_SEDET                 (0x1 << 2)    // Session end detected
#define  _OTG_HS_GLOBAL_OTG_HS_GOTGINT_SRSSCHG               (0x1 << 8)    // Session request success status change
#define  _OTG_HS_GLOBAL_OTG_HS_GOTGINT_HNSSCHG               (0x1 << 9)    // Host negotiation success status change
#define  _OTG_HS_GLOBAL_OTG_HS_GOTGINT_HNGDET                (0x1 << 17)    // Host negotiation detected
#define  _OTG_HS_GLOBAL_OTG_HS_GOTGINT_ADTOCHG               (0x1 << 18)    // A-device timeout change
#define  _OTG_HS_GLOBAL_OTG_HS_GOTGINT_DBCDNE                (0x1 << 19)    // Debounce done
#define  _OTG_HS_GLOBAL_OTG_HS_GOTGINT_IDCHNG                (0x1 << 20)    // ID input pin changed
#define  _OTG_HS_GLOBAL_OTG_HS_GAHBCFG_GINT                  (0x1 << 0)    // Global interrupt mask
#define  _OTG_HS_GLOBAL_OTG_HS_GAHBCFG_HBSTLEN               (0xf << 1)    // Burst length/type
#define  _OTG_HS_GLOBAL_OTG_HS_GAHBCFG_DMAEN                 (0x1 << 5)    // DMA enable
#define  _OTG_HS_GLOBAL_OTG_HS_GAHBCFG_TXFELVL               (0x1 << 7)    // TxFIFO empty level
#define  _OTG_HS_GLOBAL_OTG_HS_GAHBCFG_PTXFELVL              (0x1 << 8)    // Periodic TxFIFO empty level
#define  _OTG_HS_GLOBAL_OTG_HS_GUSBCFG_TOCAL                 (0x7 << 0)    // FS timeout calibration
#define  _OTG_HS_GLOBAL_OTG_HS_GUSBCFG_PHYSEL                (0x1 << 6)    // USB 2.0 high-speed ULPI PHY or USB 1.1 full-speed serial transceiver select
#define  _OTG_HS_GLOBAL_OTG_HS_GUSBCFG_SRPCAP                (0x1 << 8)    // SRP-capable
#define  _OTG_HS_GLOBAL_OTG_HS_GUSBCFG_HNPCAP                (0x1 << 9)    // HNP-capable
#define  _OTG_HS_GLOBAL_OTG_HS_GUSBCFG_TRDT                  (0xf << 10)    // USB turnaround time
#define  _OTG_HS_GLOBAL_OTG_HS_GUSBCFG_PHYLPCS               (0x1 << 15)    // PHY Low-power clock select
#define  _OTG_HS_GLOBAL_OTG_HS_GUSBCFG_ULPIFSLS              (0x1 << 17)    // ULPI FS/LS select
#define  _OTG_HS_GLOBAL_OTG_HS_GUSBCFG_ULPIAR                (0x1 << 18)    // ULPI Auto-resume
#define  _OTG_HS_GLOBAL_OTG_HS_GUSBCFG_ULPICSM               (0x1 << 19)    // ULPI Clock SuspendM
#define  _OTG_HS_GLOBAL_OTG_HS_GUSBCFG_ULPIEVBUSD            (0x1 << 20)    // ULPI External VBUS Drive
#define  _OTG_HS_GLOBAL_OTG_HS_GUSBCFG_ULPIEVBUSI            (0x1 << 21)    // ULPI external VBUS indicator
#define  _OTG_HS_GLOBAL_OTG_HS_GUSBCFG_TSDPS                 (0x1 << 22)    // TermSel DLine pulsing selection
#define  _OTG_HS_GLOBAL_OTG_HS_GUSBCFG_PCCI                  (0x1 << 23)    // Indicator complement
#define  _OTG_HS_GLOBAL_OTG_HS_GUSBCFG_PTCI                  (0x1 << 24)    // Indicator pass through
#define  _OTG_HS_GLOBAL_OTG_HS_GUSBCFG_ULPIIPD               (0x1 << 25)    // ULPI interface protect disable
#define  _OTG_HS_GLOBAL_OTG_HS_GUSBCFG_FHMOD                 (0x1 << 29)    // Forced host mode
#define  _OTG_HS_GLOBAL_OTG_HS_GUSBCFG_FDMOD                 (0x1 << 30)    // Forced peripheral mode
#define  _OTG_HS_GLOBAL_OTG_HS_GRSTCTL_CSRST                 (0x1 << 0)    // Core soft reset
#define  _OTG_HS_GLOBAL_OTG_HS_GRSTCTL_HSRST                 (0x1 << 1)    // HCLK soft reset
#define  _OTG_HS_GLOBAL_OTG_HS_GRSTCTL_FCRST                 (0x1 << 2)    // Host frame counter reset
#define  _OTG_HS_GLOBAL_OTG_HS_GRSTCTL_RXFFLSH               (0x1 << 4)    // RxFIFO flush
#define  _OTG_HS_GLOBAL_OTG_HS_GRSTCTL_TXFFLSH               (0x1 << 5)    // TxFIFO flush
#define  _OTG_HS_GLOBAL_OTG_HS_GRSTCTL_TXFNUM                (0x1f << 6)    // TxFIFO number
#define  _OTG_HS_GLOBAL_OTG_HS_GRSTCTL_AHBIDL                (0x1 << 31)    // AHB master idle
#define  _OTG_HS_GLOBAL_OTG_HS_GRSTCTL_DMAREQ                (0x1 << 30)    // DMA request signal enabled for USB OTG HS
#define  _OTG_HS_GLOBAL_OTG_HS_GINTSTS_CMOD                  (0x1 << 0)    // Current mode of operation
#define  _OTG_HS_GLOBAL_OTG_HS_GINTSTS_MMIS                  (0x1 << 1)    // Mode mismatch interrupt
#define  _OTG_HS_GLOBAL_OTG_HS_GINTSTS_OTGINT                (0x1 << 2)    // OTG interrupt
#define  _OTG_HS_GLOBAL_OTG_HS_GINTSTS_SOF                   (0x1 << 3)    // Start of frame
#define  _OTG_HS_GLOBAL_OTG_HS_GINTSTS_RXFLVL                (0x1 << 4)    // RxFIFO nonempty
#define  _OTG_HS_GLOBAL_OTG_HS_GINTSTS_NPTXFE                (0x1 << 5)    // Nonperiodic TxFIFO empty
#define  _OTG_HS_GLOBAL_OTG_HS_GINTSTS_GINAKEFF              (0x1 << 6)    // Global IN nonperiodic NAK effective
#define  _OTG_HS_GLOBAL_OTG_HS_GINTSTS_BOUTNAKEFF            (0x1 << 7)    // Global OUT NAK effective
#define  _OTG_HS_GLOBAL_OTG_HS_GINTSTS_ESUSP                 (0x1 << 10)    // Early suspend
#define  _OTG_HS_GLOBAL_OTG_HS_GINTSTS_USBSUSP               (0x1 << 11)    // USB suspend
#define  _OTG_HS_GLOBAL_OTG_HS_GINTSTS_USBRST                (0x1 << 12)    // USB reset
#define  _OTG_HS_GLOBAL_OTG_HS_GINTSTS_ENUMDNE               (0x1 << 13)    // Enumeration done
#define  _OTG_HS_GLOBAL_OTG_HS_GINTSTS_ISOODRP               (0x1 << 14)    // Isochronous OUT packet dropped interrupt
#define  _OTG_HS_GLOBAL_OTG_HS_GINTSTS_EOPF                  (0x1 << 15)    // End of periodic frame interrupt
#define  _OTG_HS_GLOBAL_OTG_HS_GINTSTS_IEPINT                (0x1 << 18)    // IN endpoint interrupt
#define  _OTG_HS_GLOBAL_OTG_HS_GINTSTS_OEPINT                (0x1 << 19)    // OUT endpoint interrupt
#define  _OTG_HS_GLOBAL_OTG_HS_GINTSTS_IISOIXFR              (0x1 << 20)    // Incomplete isochronous IN transfer
#define  _OTG_HS_GLOBAL_OTG_HS_GINTSTS_PXFR_INCOMPISOOUT     (0x1 << 21)    // Incomplete periodic transfer
#define  _OTG_HS_GLOBAL_OTG_HS_GINTSTS_DATAFSUSP             (0x1 << 22)    // Data fetch suspended
#define  _OTG_HS_GLOBAL_OTG_HS_GINTSTS_HPRTINT               (0x1 << 24)    // Host port interrupt
#define  _OTG_HS_GLOBAL_OTG_HS_GINTSTS_HCINT                 (0x1 << 25)    // Host channels interrupt
#define  _OTG_HS_GLOBAL_OTG_HS_GINTSTS_PTXFE                 (0x1 << 26)    // Periodic TxFIFO empty
#define  _OTG_HS_GLOBAL_OTG_HS_GINTSTS_CIDSCHG               (0x1 << 28)    // Connector ID status change
#define  _OTG_HS_GLOBAL_OTG_HS_GINTSTS_DISCINT               (0x1 << 29)    // Disconnect detected interrupt
#define  _OTG_HS_GLOBAL_OTG_HS_GINTSTS_SRQINT                (0x1 << 30)    // Session request/new session detected interrupt
#define  _OTG_HS_GLOBAL_OTG_HS_GINTSTS_WKUINT                (0x1 << 31)    // Resume/remote wakeup detected interrupt
#define  _OTG_HS_GLOBAL_OTG_HS_GINTMSK_MMISM                 (0x1 << 1)    // Mode mismatch interrupt mask
#define  _OTG_HS_GLOBAL_OTG_HS_GINTMSK_OTGINT                (0x1 << 2)    // OTG interrupt mask
#define  _OTG_HS_GLOBAL_OTG_HS_GINTMSK_SOFM                  (0x1 << 3)    // Start of frame mask
#define  _OTG_HS_GLOBAL_OTG_HS_GINTMSK_RXFLVLM               (0x1 << 4)    // Receive FIFO nonempty mask
#define  _OTG_HS_GLOBAL_OTG_HS_GINTMSK_NPTXFEM               (0x1 << 5)    // Nonperiodic TxFIFO empty mask
#define  _OTG_HS_GLOBAL_OTG_HS_GINTMSK_GINAKEFFM             (0x1 << 6)    // Global nonperiodic IN NAK effective mask
#define  _OTG_HS_GLOBAL_OTG_HS_GINTMSK_GONAKEFFM             (0x1 << 7)    // Global OUT NAK effective mask
#define  _OTG_HS_GLOBAL_OTG_HS_GINTMSK_ESUSPM                (0x1 << 10)    // Early suspend mask
#define  _OTG_HS_GLOBAL_OTG_HS_GINTMSK_USBSUSPM              (0x1 << 11)    // USB suspend mask
#define  _OTG_HS_GLOBAL_OTG_HS_GINTMSK_USBRST                (0x1 << 12)    // USB reset mask
#define  _OTG_HS_GLOBAL_OTG_HS_GINTMSK_ENUMDNEM              (0x1 << 13)    // Enumeration done mask
#define  _OTG_HS_GLOBAL_OTG_HS_GINTMSK_ISOODRPM              (0x1 << 14)    // Isochronous OUT packet dropped interrupt mask
#define  _OTG_HS_GLOBAL_OTG_HS_GINTMSK_EOPFM                 (0x1 << 15)    // End of periodic frame interrupt mask
#define  _OTG_HS_GLOBAL_OTG_HS_GINTMSK_IEPINT                (0x1 << 18)    // IN endpoints interrupt mask
#define  _OTG_HS_GLOBAL_OTG_HS_GINTMSK_OEPINT                (0x1 << 19)    // OUT endpoints interrupt mask
#define  _OTG_HS_GLOBAL_OTG_HS_GINTMSK_IISOIXFRM             (0x1 << 20)    // Incomplete isochronous IN transfer mask
#define  _OTG_HS_GLOBAL_OTG_HS_GINTMSK_PXFRM_IISOOXFRM       (0x1 << 21)    // Incomplete periodic transfer mask
#define  _OTG_HS_GLOBAL_OTG_HS_GINTMSK_FSUSPM                (0x1 << 22)    // Data fetch suspended mask
#define  _OTG_HS_GLOBAL_OTG_HS_GINTMSK_PRTIM                 (0x1 << 24)    // Host port interrupt mask
#define  _OTG_HS_GLOBAL_OTG_HS_GINTMSK_HCIM                  (0x1 << 25)    // Host channels interrupt mask
#define  _OTG_HS_GLOBAL_OTG_HS_GINTMSK_PTXFEM                (0x1 << 26)    // Periodic TxFIFO empty mask
#define  _OTG_HS_GLOBAL_OTG_HS_GINTMSK_CIDSCHGM              (0x1 << 28)    // Connector ID status change mask
#define  _OTG_HS_GLOBAL_OTG_HS_GINTMSK_DISCINT               (0x1 << 29)    // Disconnect detected interrupt mask
#define  _OTG_HS_GLOBAL_OTG_HS_GINTMSK_SRQIM                 (0x1 << 30)    // Session request/new session detected interrupt mask
#define  _OTG_HS_GLOBAL_OTG_HS_GINTMSK_WUIM                  (0x1 << 31)    // Resume/remote wakeup detected interrupt mask
#define  _OTG_HS_GLOBAL_OTG_HS_GINTMSK_RSTDE                 (0x1 << 23)    // Reset detected interrupt mask
#define  _OTG_HS_GLOBAL_OTG_HS_GINTMSK_LPMINTM               (0x1 << 27)    // LPM interrupt mask
#define  _OTG_HS_GLOBAL_OTG_HS_GRXSTSR_Host_CHNUM            (0xf << 0)    // Channel number
#define  _OTG_HS_GLOBAL_OTG_HS_GRXSTSR_Host_BCNT             (0x7ff << 4)    // Byte count
#define  _OTG_HS_GLOBAL_OTG_HS_GRXSTSR_Host_DPID             (0x3 << 15)    // Data PID
#define  _OTG_HS_GLOBAL_OTG_HS_GRXSTSR_Host_PKTSTS           (0xf << 17)    // Packet status
#define  _OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Host_CHNUM            (0xf << 0)    // Channel number
#define  _OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Host_BCNT             (0x7ff << 4)    // Byte count
#define  _OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Host_DPID             (0x3 << 15)    // Data PID
#define  _OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Host_PKTSTS           (0xf << 17)    // Packet status
#define  _OTG_HS_GLOBAL_OTG_HS_GRXFSIZ_RXFD                  (0xffff << 0)    // RxFIFO depth
#define  _OTG_HS_GLOBAL_OTG_HS_HNPTXFSIZ_Host_NPTXFSA        (0xffff << 0)    // Nonperiodic transmit RAM start address
#define  _OTG_HS_GLOBAL_OTG_HS_HNPTXFSIZ_Host_NPTXFD         (0xffff << 16)    // Nonperiodic TxFIFO depth
#define  _OTG_HS_GLOBAL_OTG_HS_DIEPTXF0_Device_TX0FSA        (0xffff << 0)    // Endpoint 0 transmit RAM start address
#define  _OTG_HS_GLOBAL_OTG_HS_DIEPTXF0_Device_TX0FD         (0xffff << 16)    // Endpoint 0 TxFIFO depth
#define  _OTG_HS_GLOBAL_OTG_HS_GNPTXSTS_NPTXFSAV             (0xffff << 0)    // Nonperiodic TxFIFO space available
#define  _OTG_HS_GLOBAL_OTG_HS_GNPTXSTS_NPTQXSAV             (0xff << 16)    // Nonperiodic transmit request queue space available
#define  _OTG_HS_GLOBAL_OTG_HS_GNPTXSTS_NPTXQTOP             (0x7f << 24)    // Top of the nonperiodic transmit request queue
#define  _OTG_HS_GLOBAL_OTG_HS_GCCFG_PWRDWN                  (0x1 << 16)    // Power down
#define  _OTG_HS_GLOBAL_OTG_HS_GCCFG_BCDEN                   (0x1 << 17)    // Battery charging detector (BCD) enable
#define  _OTG_HS_GLOBAL_OTG_HS_GCCFG_DCDEN                   (0x1 << 18)    // Data contact detection (DCD) mode enable
#define  _OTG_HS_GLOBAL_OTG_HS_GCCFG_PDEN                    (0x1 << 19)    // Primary detection (PD) mode enable
#define  _OTG_HS_GLOBAL_OTG_HS_GCCFG_SDEN                    (0x1 << 20)    // Secondary detection (SD) mode enable
#define  _OTG_HS_GLOBAL_OTG_HS_GCCFG_VBDEN                   (0x1 << 21)    // USB VBUS detection enable
#define  _OTG_HS_GLOBAL_OTG_HS_GCCFG_DCDET                   (0x1 << 0)    // Data contact detection (DCD) status
#define  _OTG_HS_GLOBAL_OTG_HS_GCCFG_PDET                    (0x1 << 1)    // Primary detection (PD) status
#define  _OTG_HS_GLOBAL_OTG_HS_GCCFG_SDET                    (0x1 << 2)    // Secondary detection (SD) status
#define  _OTG_HS_GLOBAL_OTG_HS_GCCFG_PS2DET                  (0x1 << 3)    // DM pull-up detection status
#define  _OTG_HS_GLOBAL_OTG_HS_CID_PRODUCT_ID                (0xffffffff << 0)    // Product ID field
#define  _OTG_HS_GLOBAL_OTG_HS_HPTXFSIZ_PTXSA                (0xffff << 0)    // Host periodic TxFIFO start address
#define  _OTG_HS_GLOBAL_OTG_HS_HPTXFSIZ_PTXFD                (0xffff << 16)    // Host periodic TxFIFO depth
#define  _OTG_HS_GLOBAL_OTG_HS_DIEPTXF1_INEPTXSA             (0xffff << 0)    // IN endpoint FIFOx transmit RAM start address
#define  _OTG_HS_GLOBAL_OTG_HS_DIEPTXF1_INEPTXFD             (0xffff << 16)    // IN endpoint TxFIFO depth
#define  _OTG_HS_GLOBAL_OTG_HS_DIEPTXF2_INEPTXSA             (0xffff << 0)    // IN endpoint FIFOx transmit RAM start address
#define  _OTG_HS_GLOBAL_OTG_HS_DIEPTXF2_INEPTXFD             (0xffff << 16)    // IN endpoint TxFIFO depth
#define  _OTG_HS_GLOBAL_OTG_HS_DIEPTXF3_INEPTXSA             (0xffff << 0)    // IN endpoint FIFOx transmit RAM start address
#define  _OTG_HS_GLOBAL_OTG_HS_DIEPTXF3_INEPTXFD             (0xffff << 16)    // IN endpoint TxFIFO depth
#define  _OTG_HS_GLOBAL_OTG_HS_DIEPTXF4_INEPTXSA             (0xffff << 0)    // IN endpoint FIFOx transmit RAM start address
#define  _OTG_HS_GLOBAL_OTG_HS_DIEPTXF4_INEPTXFD             (0xffff << 16)    // IN endpoint TxFIFO depth
#define  _OTG_HS_GLOBAL_OTG_HS_DIEPTXF5_INEPTXSA             (0xffff << 0)    // IN endpoint FIFOx transmit RAM start address
#define  _OTG_HS_GLOBAL_OTG_HS_DIEPTXF5_INEPTXFD             (0xffff << 16)    // IN endpoint TxFIFO depth
#define  _OTG_HS_GLOBAL_OTG_HS_DIEPTXF6_INEPTXSA             (0xffff << 0)    // IN endpoint FIFOx transmit RAM start address
#define  _OTG_HS_GLOBAL_OTG_HS_DIEPTXF6_INEPTXFD             (0xffff << 16)    // IN endpoint TxFIFO depth
#define  _OTG_HS_GLOBAL_OTG_HS_DIEPTXF7_INEPTXSA             (0xffff << 0)    // IN endpoint FIFOx transmit RAM start address
#define  _OTG_HS_GLOBAL_OTG_HS_DIEPTXF7_INEPTXFD             (0xffff << 16)    // IN endpoint TxFIFO depth
#define  _OTG_HS_GLOBAL_OTG_HS_GRXSTSR_Device_EPNUM          (0xf << 0)    // Endpoint number
#define  _OTG_HS_GLOBAL_OTG_HS_GRXSTSR_Device_BCNT           (0x7ff << 4)    // Byte count
#define  _OTG_HS_GLOBAL_OTG_HS_GRXSTSR_Device_DPID           (0x3 << 15)    // Data PID
#define  _OTG_HS_GLOBAL_OTG_HS_GRXSTSR_Device_PKTSTS         (0xf << 17)    // Packet status
#define  _OTG_HS_GLOBAL_OTG_HS_GRXSTSR_Device_FRMNUM         (0xf << 21)    // Frame number
#define  _OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Device_EPNUM          (0xf << 0)    // Endpoint number
#define  _OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Device_BCNT           (0x7ff << 4)    // Byte count
#define  _OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Device_DPID           (0x3 << 15)    // Data PID
#define  _OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Device_PKTSTS         (0xf << 17)    // Packet status
#define  _OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Device_FRMNUM         (0xf << 21)    // Frame number
#define  _OTG_HS_GLOBAL_OTG_HS_GLPMCFG_LPMEN                 (0x1 << 0)    // LPM support enable
#define  _OTG_HS_GLOBAL_OTG_HS_GLPMCFG_LPMACK                (0x1 << 1)    // LPM token acknowledge enable
#define  _OTG_HS_GLOBAL_OTG_HS_GLPMCFG_BESL                  (0xf << 2)    // Best effort service latency
#define  _OTG_HS_GLOBAL_OTG_HS_GLPMCFG_REMWAKE               (0x1 << 6)    // bRemoteWake value
#define  _OTG_HS_GLOBAL_OTG_HS_GLPMCFG_L1SSEN                (0x1 << 7)    // L1 Shallow Sleep enable
#define  _OTG_HS_GLOBAL_OTG_HS_GLPMCFG_BESLTHRS              (0xf << 8)    // BESL threshold
#define  _OTG_HS_GLOBAL_OTG_HS_GLPMCFG_L1DSEN                (0x1 << 12)    // L1 deep sleep enable
#define  _OTG_HS_GLOBAL_OTG_HS_GLPMCFG_LPMRST                (0x3 << 13)    // LPM response
#define  _OTG_HS_GLOBAL_OTG_HS_GLPMCFG_SLPSTS                (0x1 << 15)    // Port sleep status
#define  _OTG_HS_GLOBAL_OTG_HS_GLPMCFG_L1RSMOK               (0x1 << 16)    // Sleep State Resume OK
#define  _OTG_HS_GLOBAL_OTG_HS_GLPMCFG_LPMCHIDX              (0xf << 17)    // LPM Channel Index
#define  _OTG_HS_GLOBAL_OTG_HS_GLPMCFG_LPMRCNT               (0x7 << 21)    // LPM retry count
#define  _OTG_HS_GLOBAL_OTG_HS_GLPMCFG_SNDLPM                (0x1 << 24)    // Send LPM transaction
#define  _OTG_HS_GLOBAL_OTG_HS_GLPMCFG_LPMRCNTSTS            (0x7 << 25)    // LPM retry count status
#define  _OTG_HS_GLOBAL_OTG_HS_GLPMCFG_ENBESL                (0x1 << 28)    // Enable best effort service latency
#define  _OTG_HS_HOST_OTG_HS_HCFG_FSLSPCS                    (0x3 << 0)    // FS/LS PHY clock select
#define  _OTG_HS_HOST_OTG_HS_HCFG_FSLSS                      (0x1 << 2)    // FS- and LS-only support
#define  _OTG_HS_HOST_OTG_HS_HFIR_FRIVL                      (0xffff << 0)    // Frame interval
#define  _OTG_HS_HOST_OTG_HS_HFNUM_FRNUM                     (0xffff << 0)    // Frame number
#define  _OTG_HS_HOST_OTG_HS_HFNUM_FTREM                     (0xffff << 16)    // Frame time remaining
#define  _OTG_HS_HOST_OTG_HS_HPTXSTS_PTXFSAVL                (0xffff << 0)    // Periodic transmit data FIFO space available
#define  _OTG_HS_HOST_OTG_HS_HPTXSTS_PTXQSAV                 (0xff << 16)    // Periodic transmit request queue space available
#define  _OTG_HS_HOST_OTG_HS_HPTXSTS_PTXQTOP                 (0xff << 24)    // Top of the periodic transmit request queue
#define  _OTG_HS_HOST_OTG_HS_HAINT_HAINT                     (0xffff << 0)    // Channel interrupts
#define  _OTG_HS_HOST_OTG_HS_HAINTMSK_HAINTM                 (0xffff << 0)    // Channel interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HPRT_PCSTS                      (0x1 << 0)    // Port connect status
#define  _OTG_HS_HOST_OTG_HS_HPRT_PCDET                      (0x1 << 1)    // Port connect detected
#define  _OTG_HS_HOST_OTG_HS_HPRT_PENA                       (0x1 << 2)    // Port enable
#define  _OTG_HS_HOST_OTG_HS_HPRT_PENCHNG                    (0x1 << 3)    // Port enable/disable change
#define  _OTG_HS_HOST_OTG_HS_HPRT_POCA                       (0x1 << 4)    // Port overcurrent active
#define  _OTG_HS_HOST_OTG_HS_HPRT_POCCHNG                    (0x1 << 5)    // Port overcurrent change
#define  _OTG_HS_HOST_OTG_HS_HPRT_PRES                       (0x1 << 6)    // Port resume
#define  _OTG_HS_HOST_OTG_HS_HPRT_PSUSP                      (0x1 << 7)    // Port suspend
#define  _OTG_HS_HOST_OTG_HS_HPRT_PRST                       (0x1 << 8)    // Port reset
#define  _OTG_HS_HOST_OTG_HS_HPRT_PLSTS                      (0x3 << 10)    // Port line status
#define  _OTG_HS_HOST_OTG_HS_HPRT_PPWR                       (0x1 << 12)    // Port power
#define  _OTG_HS_HOST_OTG_HS_HPRT_PTCTL                      (0xf << 13)    // Port test control
#define  _OTG_HS_HOST_OTG_HS_HPRT_PSPD                       (0x3 << 17)    // Port speed
#define  _OTG_HS_HOST_OTG_HS_HCCHAR0_MPSIZ                   (0x7ff << 0)    // Maximum packet size
#define  _OTG_HS_HOST_OTG_HS_HCCHAR0_EPNUM                   (0xf << 11)    // Endpoint number
#define  _OTG_HS_HOST_OTG_HS_HCCHAR0_EPDIR                   (0x1 << 15)    // Endpoint direction
#define  _OTG_HS_HOST_OTG_HS_HCCHAR0_LSDEV                   (0x1 << 17)    // Low-speed device
#define  _OTG_HS_HOST_OTG_HS_HCCHAR0_EPTYP                   (0x3 << 18)    // Endpoint type
#define  _OTG_HS_HOST_OTG_HS_HCCHAR0_MC                      (0x3 << 20)    // Multi Count (MC) / Error Count (EC)
#define  _OTG_HS_HOST_OTG_HS_HCCHAR0_DAD                     (0x7f << 22)    // Device address
#define  _OTG_HS_HOST_OTG_HS_HCCHAR0_ODDFRM                  (0x1 << 29)    // Odd frame
#define  _OTG_HS_HOST_OTG_HS_HCCHAR0_CHDIS                   (0x1 << 30)    // Channel disable
#define  _OTG_HS_HOST_OTG_HS_HCCHAR0_CHENA                   (0x1 << 31)    // Channel enable
#define  _OTG_HS_HOST_OTG_HS_HCCHAR1_MPSIZ                   (0x7ff << 0)    // Maximum packet size
#define  _OTG_HS_HOST_OTG_HS_HCCHAR1_EPNUM                   (0xf << 11)    // Endpoint number
#define  _OTG_HS_HOST_OTG_HS_HCCHAR1_EPDIR                   (0x1 << 15)    // Endpoint direction
#define  _OTG_HS_HOST_OTG_HS_HCCHAR1_LSDEV                   (0x1 << 17)    // Low-speed device
#define  _OTG_HS_HOST_OTG_HS_HCCHAR1_EPTYP                   (0x3 << 18)    // Endpoint type
#define  _OTG_HS_HOST_OTG_HS_HCCHAR1_MC                      (0x3 << 20)    // Multi Count (MC) / Error Count (EC)
#define  _OTG_HS_HOST_OTG_HS_HCCHAR1_DAD                     (0x7f << 22)    // Device address
#define  _OTG_HS_HOST_OTG_HS_HCCHAR1_ODDFRM                  (0x1 << 29)    // Odd frame
#define  _OTG_HS_HOST_OTG_HS_HCCHAR1_CHDIS                   (0x1 << 30)    // Channel disable
#define  _OTG_HS_HOST_OTG_HS_HCCHAR1_CHENA                   (0x1 << 31)    // Channel enable
#define  _OTG_HS_HOST_OTG_HS_HCCHAR2_MPSIZ                   (0x7ff << 0)    // Maximum packet size
#define  _OTG_HS_HOST_OTG_HS_HCCHAR2_EPNUM                   (0xf << 11)    // Endpoint number
#define  _OTG_HS_HOST_OTG_HS_HCCHAR2_EPDIR                   (0x1 << 15)    // Endpoint direction
#define  _OTG_HS_HOST_OTG_HS_HCCHAR2_LSDEV                   (0x1 << 17)    // Low-speed device
#define  _OTG_HS_HOST_OTG_HS_HCCHAR2_EPTYP                   (0x3 << 18)    // Endpoint type
#define  _OTG_HS_HOST_OTG_HS_HCCHAR2_MC                      (0x3 << 20)    // Multi Count (MC) / Error Count (EC)
#define  _OTG_HS_HOST_OTG_HS_HCCHAR2_DAD                     (0x7f << 22)    // Device address
#define  _OTG_HS_HOST_OTG_HS_HCCHAR2_ODDFRM                  (0x1 << 29)    // Odd frame
#define  _OTG_HS_HOST_OTG_HS_HCCHAR2_CHDIS                   (0x1 << 30)    // Channel disable
#define  _OTG_HS_HOST_OTG_HS_HCCHAR2_CHENA                   (0x1 << 31)    // Channel enable
#define  _OTG_HS_HOST_OTG_HS_HCCHAR3_MPSIZ                   (0x7ff << 0)    // Maximum packet size
#define  _OTG_HS_HOST_OTG_HS_HCCHAR3_EPNUM                   (0xf << 11)    // Endpoint number
#define  _OTG_HS_HOST_OTG_HS_HCCHAR3_EPDIR                   (0x1 << 15)    // Endpoint direction
#define  _OTG_HS_HOST_OTG_HS_HCCHAR3_LSDEV                   (0x1 << 17)    // Low-speed device
#define  _OTG_HS_HOST_OTG_HS_HCCHAR3_EPTYP                   (0x3 << 18)    // Endpoint type
#define  _OTG_HS_HOST_OTG_HS_HCCHAR3_MC                      (0x3 << 20)    // Multi Count (MC) / Error Count (EC)
