7h3qu1rkyb1t/stm32f7-drivers/drivers/inc/stm32f767xx_USB_OTG_HS.h
#define  _OTG_HS_HOST_OTG_HS_HCCHAR3_DAD                     (0x7f << 22)    // Device address
#define  _OTG_HS_HOST_OTG_HS_HCCHAR3_ODDFRM                  (0x1 << 29)    // Odd frame
#define  _OTG_HS_HOST_OTG_HS_HCCHAR3_CHDIS                   (0x1 << 30)    // Channel disable
#define  _OTG_HS_HOST_OTG_HS_HCCHAR3_CHENA                   (0x1 << 31)    // Channel enable
#define  _OTG_HS_HOST_OTG_HS_HCCHAR4_MPSIZ                   (0x7ff << 0)    // Maximum packet size
#define  _OTG_HS_HOST_OTG_HS_HCCHAR4_EPNUM                   (0xf << 11)    // Endpoint number
#define  _OTG_HS_HOST_OTG_HS_HCCHAR4_EPDIR                   (0x1 << 15)    // Endpoint direction
#define  _OTG_HS_HOST_OTG_HS_HCCHAR4_LSDEV                   (0x1 << 17)    // Low-speed device
#define  _OTG_HS_HOST_OTG_HS_HCCHAR4_EPTYP                   (0x3 << 18)    // Endpoint type
#define  _OTG_HS_HOST_OTG_HS_HCCHAR4_MC                      (0x3 << 20)    // Multi Count (MC) / Error Count (EC)
#define  _OTG_HS_HOST_OTG_HS_HCCHAR4_DAD                     (0x7f << 22)    // Device address
#define  _OTG_HS_HOST_OTG_HS_HCCHAR4_ODDFRM                  (0x1 << 29)    // Odd frame
#define  _OTG_HS_HOST_OTG_HS_HCCHAR4_CHDIS                   (0x1 << 30)    // Channel disable
#define  _OTG_HS_HOST_OTG_HS_HCCHAR4_CHENA                   (0x1 << 31)    // Channel enable
#define  _OTG_HS_HOST_OTG_HS_HCCHAR5_MPSIZ                   (0x7ff << 0)    // Maximum packet size
#define  _OTG_HS_HOST_OTG_HS_HCCHAR5_EPNUM                   (0xf << 11)    // Endpoint number
#define  _OTG_HS_HOST_OTG_HS_HCCHAR5_EPDIR                   (0x1 << 15)    // Endpoint direction
#define  _OTG_HS_HOST_OTG_HS_HCCHAR5_LSDEV                   (0x1 << 17)    // Low-speed device
#define  _OTG_HS_HOST_OTG_HS_HCCHAR5_EPTYP                   (0x3 << 18)    // Endpoint type
#define  _OTG_HS_HOST_OTG_HS_HCCHAR5_MC                      (0x3 << 20)    // Multi Count (MC) / Error Count (EC)
#define  _OTG_HS_HOST_OTG_HS_HCCHAR5_DAD                     (0x7f << 22)    // Device address
#define  _OTG_HS_HOST_OTG_HS_HCCHAR5_ODDFRM                  (0x1 << 29)    // Odd frame
#define  _OTG_HS_HOST_OTG_HS_HCCHAR5_CHDIS                   (0x1 << 30)    // Channel disable
#define  _OTG_HS_HOST_OTG_HS_HCCHAR5_CHENA                   (0x1 << 31)    // Channel enable
#define  _OTG_HS_HOST_OTG_HS_HCCHAR6_MPSIZ                   (0x7ff << 0)    // Maximum packet size
#define  _OTG_HS_HOST_OTG_HS_HCCHAR6_EPNUM                   (0xf << 11)    // Endpoint number
#define  _OTG_HS_HOST_OTG_HS_HCCHAR6_EPDIR                   (0x1 << 15)    // Endpoint direction
#define  _OTG_HS_HOST_OTG_HS_HCCHAR6_LSDEV                   (0x1 << 17)    // Low-speed device
#define  _OTG_HS_HOST_OTG_HS_HCCHAR6_EPTYP                   (0x3 << 18)    // Endpoint type
#define  _OTG_HS_HOST_OTG_HS_HCCHAR6_MC                      (0x3 << 20)    // Multi Count (MC) / Error Count (EC)
#define  _OTG_HS_HOST_OTG_HS_HCCHAR6_DAD                     (0x7f << 22)    // Device address
#define  _OTG_HS_HOST_OTG_HS_HCCHAR6_ODDFRM                  (0x1 << 29)    // Odd frame
#define  _OTG_HS_HOST_OTG_HS_HCCHAR6_CHDIS                   (0x1 << 30)    // Channel disable
#define  _OTG_HS_HOST_OTG_HS_HCCHAR6_CHENA                   (0x1 << 31)    // Channel enable
#define  _OTG_HS_HOST_OTG_HS_HCCHAR7_MPSIZ                   (0x7ff << 0)    // Maximum packet size
#define  _OTG_HS_HOST_OTG_HS_HCCHAR7_EPNUM                   (0xf << 11)    // Endpoint number
#define  _OTG_HS_HOST_OTG_HS_HCCHAR7_EPDIR                   (0x1 << 15)    // Endpoint direction
#define  _OTG_HS_HOST_OTG_HS_HCCHAR7_LSDEV                   (0x1 << 17)    // Low-speed device
#define  _OTG_HS_HOST_OTG_HS_HCCHAR7_EPTYP                   (0x3 << 18)    // Endpoint type
#define  _OTG_HS_HOST_OTG_HS_HCCHAR7_MC                      (0x3 << 20)    // Multi Count (MC) / Error Count (EC)
#define  _OTG_HS_HOST_OTG_HS_HCCHAR7_DAD                     (0x7f << 22)    // Device address
#define  _OTG_HS_HOST_OTG_HS_HCCHAR7_ODDFRM                  (0x1 << 29)    // Odd frame
#define  _OTG_HS_HOST_OTG_HS_HCCHAR7_CHDIS                   (0x1 << 30)    // Channel disable
#define  _OTG_HS_HOST_OTG_HS_HCCHAR7_CHENA                   (0x1 << 31)    // Channel enable
#define  _OTG_HS_HOST_OTG_HS_HCCHAR8_MPSIZ                   (0x7ff << 0)    // Maximum packet size
#define  _OTG_HS_HOST_OTG_HS_HCCHAR8_EPNUM                   (0xf << 11)    // Endpoint number
#define  _OTG_HS_HOST_OTG_HS_HCCHAR8_EPDIR                   (0x1 << 15)    // Endpoint direction
#define  _OTG_HS_HOST_OTG_HS_HCCHAR8_LSDEV                   (0x1 << 17)    // Low-speed device
#define  _OTG_HS_HOST_OTG_HS_HCCHAR8_EPTYP                   (0x3 << 18)    // Endpoint type
#define  _OTG_HS_HOST_OTG_HS_HCCHAR8_MC                      (0x3 << 20)    // Multi Count (MC) / Error Count (EC)
#define  _OTG_HS_HOST_OTG_HS_HCCHAR8_DAD                     (0x7f << 22)    // Device address
#define  _OTG_HS_HOST_OTG_HS_HCCHAR8_ODDFRM                  (0x1 << 29)    // Odd frame
#define  _OTG_HS_HOST_OTG_HS_HCCHAR8_CHDIS                   (0x1 << 30)    // Channel disable
#define  _OTG_HS_HOST_OTG_HS_HCCHAR8_CHENA                   (0x1 << 31)    // Channel enable
#define  _OTG_HS_HOST_OTG_HS_HCCHAR9_MPSIZ                   (0x7ff << 0)    // Maximum packet size
#define  _OTG_HS_HOST_OTG_HS_HCCHAR9_EPNUM                   (0xf << 11)    // Endpoint number
#define  _OTG_HS_HOST_OTG_HS_HCCHAR9_EPDIR                   (0x1 << 15)    // Endpoint direction
#define  _OTG_HS_HOST_OTG_HS_HCCHAR9_LSDEV                   (0x1 << 17)    // Low-speed device
#define  _OTG_HS_HOST_OTG_HS_HCCHAR9_EPTYP                   (0x3 << 18)    // Endpoint type
#define  _OTG_HS_HOST_OTG_HS_HCCHAR9_MC                      (0x3 << 20)    // Multi Count (MC) / Error Count (EC)
#define  _OTG_HS_HOST_OTG_HS_HCCHAR9_DAD                     (0x7f << 22)    // Device address
#define  _OTG_HS_HOST_OTG_HS_HCCHAR9_ODDFRM                  (0x1 << 29)    // Odd frame
#define  _OTG_HS_HOST_OTG_HS_HCCHAR9_CHDIS                   (0x1 << 30)    // Channel disable
#define  _OTG_HS_HOST_OTG_HS_HCCHAR9_CHENA                   (0x1 << 31)    // Channel enable
#define  _OTG_HS_HOST_OTG_HS_HCCHAR10_MPSIZ                  (0x7ff << 0)    // Maximum packet size
#define  _OTG_HS_HOST_OTG_HS_HCCHAR10_EPNUM                  (0xf << 11)    // Endpoint number
#define  _OTG_HS_HOST_OTG_HS_HCCHAR10_EPDIR                  (0x1 << 15)    // Endpoint direction
#define  _OTG_HS_HOST_OTG_HS_HCCHAR10_LSDEV                  (0x1 << 17)    // Low-speed device
#define  _OTG_HS_HOST_OTG_HS_HCCHAR10_EPTYP                  (0x3 << 18)    // Endpoint type
#define  _OTG_HS_HOST_OTG_HS_HCCHAR10_MC                     (0x3 << 20)    // Multi Count (MC) / Error Count (EC)
#define  _OTG_HS_HOST_OTG_HS_HCCHAR10_DAD                    (0x7f << 22)    // Device address
#define  _OTG_HS_HOST_OTG_HS_HCCHAR10_ODDFRM                 (0x1 << 29)    // Odd frame
#define  _OTG_HS_HOST_OTG_HS_HCCHAR10_CHDIS                  (0x1 << 30)    // Channel disable
#define  _OTG_HS_HOST_OTG_HS_HCCHAR10_CHENA                  (0x1 << 31)    // Channel enable
#define  _OTG_HS_HOST_OTG_HS_HCCHAR11_MPSIZ                  (0x7ff << 0)    // Maximum packet size
#define  _OTG_HS_HOST_OTG_HS_HCCHAR11_EPNUM                  (0xf << 11)    // Endpoint number
#define  _OTG_HS_HOST_OTG_HS_HCCHAR11_EPDIR                  (0x1 << 15)    // Endpoint direction
#define  _OTG_HS_HOST_OTG_HS_HCCHAR11_LSDEV                  (0x1 << 17)    // Low-speed device
#define  _OTG_HS_HOST_OTG_HS_HCCHAR11_EPTYP                  (0x3 << 18)    // Endpoint type
#define  _OTG_HS_HOST_OTG_HS_HCCHAR11_MC                     (0x3 << 20)    // Multi Count (MC) / Error Count (EC)
#define  _OTG_HS_HOST_OTG_HS_HCCHAR11_DAD                    (0x7f << 22)    // Device address
#define  _OTG_HS_HOST_OTG_HS_HCCHAR11_ODDFRM                 (0x1 << 29)    // Odd frame
#define  _OTG_HS_HOST_OTG_HS_HCCHAR11_CHDIS                  (0x1 << 30)    // Channel disable
#define  _OTG_HS_HOST_OTG_HS_HCCHAR11_CHENA                  (0x1 << 31)    // Channel enable
#define  _OTG_HS_HOST_OTG_HS_HCSPLT0_PRTADDR                 (0x7f << 0)    // Port address
#define  _OTG_HS_HOST_OTG_HS_HCSPLT0_HUBADDR                 (0x7f << 7)    // Hub address
#define  _OTG_HS_HOST_OTG_HS_HCSPLT0_XACTPOS                 (0x3 << 14)    // XACTPOS
#define  _OTG_HS_HOST_OTG_HS_HCSPLT0_COMPLSPLT               (0x1 << 16)    // Do complete split
#define  _OTG_HS_HOST_OTG_HS_HCSPLT0_SPLITEN                 (0x1 << 31)    // Split enable
#define  _OTG_HS_HOST_OTG_HS_HCSPLT1_PRTADDR                 (0x7f << 0)    // Port address
#define  _OTG_HS_HOST_OTG_HS_HCSPLT1_HUBADDR                 (0x7f << 7)    // Hub address
#define  _OTG_HS_HOST_OTG_HS_HCSPLT1_XACTPOS                 (0x3 << 14)    // XACTPOS
#define  _OTG_HS_HOST_OTG_HS_HCSPLT1_COMPLSPLT               (0x1 << 16)    // Do complete split
#define  _OTG_HS_HOST_OTG_HS_HCSPLT1_SPLITEN                 (0x1 << 31)    // Split enable
#define  _OTG_HS_HOST_OTG_HS_HCSPLT2_PRTADDR                 (0x7f << 0)    // Port address
#define  _OTG_HS_HOST_OTG_HS_HCSPLT2_HUBADDR                 (0x7f << 7)    // Hub address
#define  _OTG_HS_HOST_OTG_HS_HCSPLT2_XACTPOS                 (0x3 << 14)    // XACTPOS
#define  _OTG_HS_HOST_OTG_HS_HCSPLT2_COMPLSPLT               (0x1 << 16)    // Do complete split
#define  _OTG_HS_HOST_OTG_HS_HCSPLT2_SPLITEN                 (0x1 << 31)    // Split enable
#define  _OTG_HS_HOST_OTG_HS_HCSPLT3_PRTADDR                 (0x7f << 0)    // Port address
#define  _OTG_HS_HOST_OTG_HS_HCSPLT3_HUBADDR                 (0x7f << 7)    // Hub address
#define  _OTG_HS_HOST_OTG_HS_HCSPLT3_XACTPOS                 (0x3 << 14)    // XACTPOS
#define  _OTG_HS_HOST_OTG_HS_HCSPLT3_COMPLSPLT               (0x1 << 16)    // Do complete split
#define  _OTG_HS_HOST_OTG_HS_HCSPLT3_SPLITEN                 (0x1 << 31)    // Split enable
#define  _OTG_HS_HOST_OTG_HS_HCSPLT4_PRTADDR                 (0x7f << 0)    // Port address
#define  _OTG_HS_HOST_OTG_HS_HCSPLT4_HUBADDR                 (0x7f << 7)    // Hub address
#define  _OTG_HS_HOST_OTG_HS_HCSPLT4_XACTPOS                 (0x3 << 14)    // XACTPOS
#define  _OTG_HS_HOST_OTG_HS_HCSPLT4_COMPLSPLT               (0x1 << 16)    // Do complete split
#define  _OTG_HS_HOST_OTG_HS_HCSPLT4_SPLITEN                 (0x1 << 31)    // Split enable
#define  _OTG_HS_HOST_OTG_HS_HCSPLT5_PRTADDR                 (0x7f << 0)    // Port address
#define  _OTG_HS_HOST_OTG_HS_HCSPLT5_HUBADDR                 (0x7f << 7)    // Hub address
#define  _OTG_HS_HOST_OTG_HS_HCSPLT5_XACTPOS                 (0x3 << 14)    // XACTPOS
#define  _OTG_HS_HOST_OTG_HS_HCSPLT5_COMPLSPLT               (0x1 << 16)    // Do complete split
#define  _OTG_HS_HOST_OTG_HS_HCSPLT5_SPLITEN                 (0x1 << 31)    // Split enable
#define  _OTG_HS_HOST_OTG_HS_HCSPLT6_PRTADDR                 (0x7f << 0)    // Port address
#define  _OTG_HS_HOST_OTG_HS_HCSPLT6_HUBADDR                 (0x7f << 7)    // Hub address
#define  _OTG_HS_HOST_OTG_HS_HCSPLT6_XACTPOS                 (0x3 << 14)    // XACTPOS
#define  _OTG_HS_HOST_OTG_HS_HCSPLT6_COMPLSPLT               (0x1 << 16)    // Do complete split
#define  _OTG_HS_HOST_OTG_HS_HCSPLT6_SPLITEN                 (0x1 << 31)    // Split enable
#define  _OTG_HS_HOST_OTG_HS_HCSPLT7_PRTADDR                 (0x7f << 0)    // Port address
#define  _OTG_HS_HOST_OTG_HS_HCSPLT7_HUBADDR                 (0x7f << 7)    // Hub address
#define  _OTG_HS_HOST_OTG_HS_HCSPLT7_XACTPOS                 (0x3 << 14)    // XACTPOS
#define  _OTG_HS_HOST_OTG_HS_HCSPLT7_COMPLSPLT               (0x1 << 16)    // Do complete split
#define  _OTG_HS_HOST_OTG_HS_HCSPLT7_SPLITEN                 (0x1 << 31)    // Split enable
#define  _OTG_HS_HOST_OTG_HS_HCSPLT8_PRTADDR                 (0x7f << 0)    // Port address
#define  _OTG_HS_HOST_OTG_HS_HCSPLT8_HUBADDR                 (0x7f << 7)    // Hub address
#define  _OTG_HS_HOST_OTG_HS_HCSPLT8_XACTPOS                 (0x3 << 14)    // XACTPOS
#define  _OTG_HS_HOST_OTG_HS_HCSPLT8_COMPLSPLT               (0x1 << 16)    // Do complete split
#define  _OTG_HS_HOST_OTG_HS_HCSPLT8_SPLITEN                 (0x1 << 31)    // Split enable
#define  _OTG_HS_HOST_OTG_HS_HCSPLT9_PRTADDR                 (0x7f << 0)    // Port address
#define  _OTG_HS_HOST_OTG_HS_HCSPLT9_HUBADDR                 (0x7f << 7)    // Hub address
#define  _OTG_HS_HOST_OTG_HS_HCSPLT9_XACTPOS                 (0x3 << 14)    // XACTPOS
#define  _OTG_HS_HOST_OTG_HS_HCSPLT9_COMPLSPLT               (0x1 << 16)    // Do complete split
#define  _OTG_HS_HOST_OTG_HS_HCSPLT9_SPLITEN                 (0x1 << 31)    // Split enable
#define  _OTG_HS_HOST_OTG_HS_HCSPLT10_PRTADDR                (0x7f << 0)    // Port address
#define  _OTG_HS_HOST_OTG_HS_HCSPLT10_HUBADDR                (0x7f << 7)    // Hub address
#define  _OTG_HS_HOST_OTG_HS_HCSPLT10_XACTPOS                (0x3 << 14)    // XACTPOS
#define  _OTG_HS_HOST_OTG_HS_HCSPLT10_COMPLSPLT              (0x1 << 16)    // Do complete split
#define  _OTG_HS_HOST_OTG_HS_HCSPLT10_SPLITEN                (0x1 << 31)    // Split enable
#define  _OTG_HS_HOST_OTG_HS_HCSPLT11_PRTADDR                (0x7f << 0)    // Port address
#define  _OTG_HS_HOST_OTG_HS_HCSPLT11_HUBADDR                (0x7f << 7)    // Hub address
#define  _OTG_HS_HOST_OTG_HS_HCSPLT11_XACTPOS                (0x3 << 14)    // XACTPOS
#define  _OTG_HS_HOST_OTG_HS_HCSPLT11_COMPLSPLT              (0x1 << 16)    // Do complete split
#define  _OTG_HS_HOST_OTG_HS_HCSPLT11_SPLITEN                (0x1 << 31)    // Split enable
#define  _OTG_HS_HOST_OTG_HS_HCINT0_XFRC                     (0x1 << 0)    // Transfer completed
#define  _OTG_HS_HOST_OTG_HS_HCINT0_CHH                      (0x1 << 1)    // Channel halted
#define  _OTG_HS_HOST_OTG_HS_HCINT0_AHBERR                   (0x1 << 2)    // AHB error
#define  _OTG_HS_HOST_OTG_HS_HCINT0_STALL                    (0x1 << 3)    // STALL response received interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT0_NAK                      (0x1 << 4)    // NAK response received interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT0_ACK                      (0x1 << 5)    // ACK response received/transmitted interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT0_NYET                     (0x1 << 6)    // Response received interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT0_TXERR                    (0x1 << 7)    // Transaction error
#define  _OTG_HS_HOST_OTG_HS_HCINT0_BBERR                    (0x1 << 8)    // Babble error
#define  _OTG_HS_HOST_OTG_HS_HCINT0_FRMOR                    (0x1 << 9)    // Frame overrun
#define  _OTG_HS_HOST_OTG_HS_HCINT0_DTERR                    (0x1 << 10)    // Data toggle error
#define  _OTG_HS_HOST_OTG_HS_HCINT1_XFRC                     (0x1 << 0)    // Transfer completed
#define  _OTG_HS_HOST_OTG_HS_HCINT1_CHH                      (0x1 << 1)    // Channel halted
#define  _OTG_HS_HOST_OTG_HS_HCINT1_AHBERR                   (0x1 << 2)    // AHB error
#define  _OTG_HS_HOST_OTG_HS_HCINT1_STALL                    (0x1 << 3)    // STALL response received interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT1_NAK                      (0x1 << 4)    // NAK response received interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT1_ACK                      (0x1 << 5)    // ACK response received/transmitted interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT1_NYET                     (0x1 << 6)    // Response received interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT1_TXERR                    (0x1 << 7)    // Transaction error
#define  _OTG_HS_HOST_OTG_HS_HCINT1_BBERR                    (0x1 << 8)    // Babble error
#define  _OTG_HS_HOST_OTG_HS_HCINT1_FRMOR                    (0x1 << 9)    // Frame overrun
#define  _OTG_HS_HOST_OTG_HS_HCINT1_DTERR                    (0x1 << 10)    // Data toggle error
#define  _OTG_HS_HOST_OTG_HS_HCINT2_XFRC                     (0x1 << 0)    // Transfer completed
#define  _OTG_HS_HOST_OTG_HS_HCINT2_CHH                      (0x1 << 1)    // Channel halted
#define  _OTG_HS_HOST_OTG_HS_HCINT2_AHBERR                   (0x1 << 2)    // AHB error
#define  _OTG_HS_HOST_OTG_HS_HCINT2_STALL                    (0x1 << 3)    // STALL response received interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT2_NAK                      (0x1 << 4)    // NAK response received interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT2_ACK                      (0x1 << 5)    // ACK response received/transmitted interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT2_NYET                     (0x1 << 6)    // Response received interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT2_TXERR                    (0x1 << 7)    // Transaction error
#define  _OTG_HS_HOST_OTG_HS_HCINT2_BBERR                    (0x1 << 8)    // Babble error
#define  _OTG_HS_HOST_OTG_HS_HCINT2_FRMOR                    (0x1 << 9)    // Frame overrun
#define  _OTG_HS_HOST_OTG_HS_HCINT2_DTERR                    (0x1 << 10)    // Data toggle error
#define  _OTG_HS_HOST_OTG_HS_HCINT3_XFRC                     (0x1 << 0)    // Transfer completed
#define  _OTG_HS_HOST_OTG_HS_HCINT3_CHH                      (0x1 << 1)    // Channel halted
#define  _OTG_HS_HOST_OTG_HS_HCINT3_AHBERR                   (0x1 << 2)    // AHB error
#define  _OTG_HS_HOST_OTG_HS_HCINT3_STALL                    (0x1 << 3)    // STALL response received interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT3_NAK                      (0x1 << 4)    // NAK response received interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT3_ACK                      (0x1 << 5)    // ACK response received/transmitted interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT3_NYET                     (0x1 << 6)    // Response received interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT3_TXERR                    (0x1 << 7)    // Transaction error
#define  _OTG_HS_HOST_OTG_HS_HCINT3_BBERR                    (0x1 << 8)    // Babble error
#define  _OTG_HS_HOST_OTG_HS_HCINT3_FRMOR                    (0x1 << 9)    // Frame overrun
#define  _OTG_HS_HOST_OTG_HS_HCINT3_DTERR                    (0x1 << 10)    // Data toggle error
#define  _OTG_HS_HOST_OTG_HS_HCINT4_XFRC                     (0x1 << 0)    // Transfer completed
#define  _OTG_HS_HOST_OTG_HS_HCINT4_CHH                      (0x1 << 1)    // Channel halted
#define  _OTG_HS_HOST_OTG_HS_HCINT4_AHBERR                   (0x1 << 2)    // AHB error
#define  _OTG_HS_HOST_OTG_HS_HCINT4_STALL                    (0x1 << 3)    // STALL response received interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT4_NAK                      (0x1 << 4)    // NAK response received interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT4_ACK                      (0x1 << 5)    // ACK response received/transmitted interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT4_NYET                     (0x1 << 6)    // Response received interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT4_TXERR                    (0x1 << 7)    // Transaction error
#define  _OTG_HS_HOST_OTG_HS_HCINT4_BBERR                    (0x1 << 8)    // Babble error
#define  _OTG_HS_HOST_OTG_HS_HCINT4_FRMOR                    (0x1 << 9)    // Frame overrun
#define  _OTG_HS_HOST_OTG_HS_HCINT4_DTERR                    (0x1 << 10)    // Data toggle error
#define  _OTG_HS_HOST_OTG_HS_HCINT5_XFRC                     (0x1 << 0)    // Transfer completed
#define  _OTG_HS_HOST_OTG_HS_HCINT5_CHH                      (0x1 << 1)    // Channel halted
#define  _OTG_HS_HOST_OTG_HS_HCINT5_AHBERR                   (0x1 << 2)    // AHB error
#define  _OTG_HS_HOST_OTG_HS_HCINT5_STALL                    (0x1 << 3)    // STALL response received interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT5_NAK                      (0x1 << 4)    // NAK response received interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT5_ACK                      (0x1 << 5)    // ACK response received/transmitted interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT5_NYET                     (0x1 << 6)    // Response received interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT5_TXERR                    (0x1 << 7)    // Transaction error
#define  _OTG_HS_HOST_OTG_HS_HCINT5_BBERR                    (0x1 << 8)    // Babble error
#define  _OTG_HS_HOST_OTG_HS_HCINT5_FRMOR                    (0x1 << 9)    // Frame overrun
#define  _OTG_HS_HOST_OTG_HS_HCINT5_DTERR                    (0x1 << 10)    // Data toggle error
#define  _OTG_HS_HOST_OTG_HS_HCINT6_XFRC                     (0x1 << 0)    // Transfer completed
#define  _OTG_HS_HOST_OTG_HS_HCINT6_CHH                      (0x1 << 1)    // Channel halted
#define  _OTG_HS_HOST_OTG_HS_HCINT6_AHBERR                   (0x1 << 2)    // AHB error
#define  _OTG_HS_HOST_OTG_HS_HCINT6_STALL                    (0x1 << 3)    // STALL response received interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT6_NAK                      (0x1 << 4)    // NAK response received interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT6_ACK                      (0x1 << 5)    // ACK response received/transmitted interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT6_NYET                     (0x1 << 6)    // Response received interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT6_TXERR                    (0x1 << 7)    // Transaction error
#define  _OTG_HS_HOST_OTG_HS_HCINT6_BBERR                    (0x1 << 8)    // Babble error
#define  _OTG_HS_HOST_OTG_HS_HCINT6_FRMOR                    (0x1 << 9)    // Frame overrun
#define  _OTG_HS_HOST_OTG_HS_HCINT6_DTERR                    (0x1 << 10)    // Data toggle error
#define  _OTG_HS_HOST_OTG_HS_HCINT7_XFRC                     (0x1 << 0)    // Transfer completed
#define  _OTG_HS_HOST_OTG_HS_HCINT7_CHH                      (0x1 << 1)    // Channel halted
#define  _OTG_HS_HOST_OTG_HS_HCINT7_AHBERR                   (0x1 << 2)    // AHB error
#define  _OTG_HS_HOST_OTG_HS_HCINT7_STALL                    (0x1 << 3)    // STALL response received interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT7_NAK                      (0x1 << 4)    // NAK response received interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT7_ACK                      (0x1 << 5)    // ACK response received/transmitted interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT7_NYET                     (0x1 << 6)    // Response received interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT7_TXERR                    (0x1 << 7)    // Transaction error
#define  _OTG_HS_HOST_OTG_HS_HCINT7_BBERR                    (0x1 << 8)    // Babble error
#define  _OTG_HS_HOST_OTG_HS_HCINT7_FRMOR                    (0x1 << 9)    // Frame overrun
#define  _OTG_HS_HOST_OTG_HS_HCINT7_DTERR                    (0x1 << 10)    // Data toggle error
#define  _OTG_HS_HOST_OTG_HS_HCINT8_XFRC                     (0x1 << 0)    // Transfer completed
#define  _OTG_HS_HOST_OTG_HS_HCINT8_CHH                      (0x1 << 1)    // Channel halted
#define  _OTG_HS_HOST_OTG_HS_HCINT8_AHBERR                   (0x1 << 2)    // AHB error
#define  _OTG_HS_HOST_OTG_HS_HCINT8_STALL                    (0x1 << 3)    // STALL response received interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT8_NAK                      (0x1 << 4)    // NAK response received interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT8_ACK                      (0x1 << 5)    // ACK response received/transmitted interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT8_NYET                     (0x1 << 6)    // Response received interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT8_TXERR                    (0x1 << 7)    // Transaction error
#define  _OTG_HS_HOST_OTG_HS_HCINT8_BBERR                    (0x1 << 8)    // Babble error
#define  _OTG_HS_HOST_OTG_HS_HCINT8_FRMOR                    (0x1 << 9)    // Frame overrun
#define  _OTG_HS_HOST_OTG_HS_HCINT8_DTERR                    (0x1 << 10)    // Data toggle error
#define  _OTG_HS_HOST_OTG_HS_HCINT9_XFRC                     (0x1 << 0)    // Transfer completed
#define  _OTG_HS_HOST_OTG_HS_HCINT9_CHH                      (0x1 << 1)    // Channel halted
#define  _OTG_HS_HOST_OTG_HS_HCINT9_AHBERR                   (0x1 << 2)    // AHB error
#define  _OTG_HS_HOST_OTG_HS_HCINT9_STALL                    (0x1 << 3)    // STALL response received interrupt
