7h3qu1rkyb1t/stm32f7-drivers/drivers/inc/stm32f767xx_USB_OTG_HS.h
#define  _OTG_HS_HOST_OTG_HS_HCINT9_NAK                      (0x1 << 4)    // NAK response received interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT9_ACK                      (0x1 << 5)    // ACK response received/transmitted interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT9_NYET                     (0x1 << 6)    // Response received interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT9_TXERR                    (0x1 << 7)    // Transaction error
#define  _OTG_HS_HOST_OTG_HS_HCINT9_BBERR                    (0x1 << 8)    // Babble error
#define  _OTG_HS_HOST_OTG_HS_HCINT9_FRMOR                    (0x1 << 9)    // Frame overrun
#define  _OTG_HS_HOST_OTG_HS_HCINT9_DTERR                    (0x1 << 10)    // Data toggle error
#define  _OTG_HS_HOST_OTG_HS_HCINT10_XFRC                    (0x1 << 0)    // Transfer completed
#define  _OTG_HS_HOST_OTG_HS_HCINT10_CHH                     (0x1 << 1)    // Channel halted
#define  _OTG_HS_HOST_OTG_HS_HCINT10_AHBERR                  (0x1 << 2)    // AHB error
#define  _OTG_HS_HOST_OTG_HS_HCINT10_STALL                   (0x1 << 3)    // STALL response received interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT10_NAK                     (0x1 << 4)    // NAK response received interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT10_ACK                     (0x1 << 5)    // ACK response received/transmitted interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT10_NYET                    (0x1 << 6)    // Response received interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT10_TXERR                   (0x1 << 7)    // Transaction error
#define  _OTG_HS_HOST_OTG_HS_HCINT10_BBERR                   (0x1 << 8)    // Babble error
#define  _OTG_HS_HOST_OTG_HS_HCINT10_FRMOR                   (0x1 << 9)    // Frame overrun
#define  _OTG_HS_HOST_OTG_HS_HCINT10_DTERR                   (0x1 << 10)    // Data toggle error
#define  _OTG_HS_HOST_OTG_HS_HCINT11_XFRC                    (0x1 << 0)    // Transfer completed
#define  _OTG_HS_HOST_OTG_HS_HCINT11_CHH                     (0x1 << 1)    // Channel halted
#define  _OTG_HS_HOST_OTG_HS_HCINT11_AHBERR                  (0x1 << 2)    // AHB error
#define  _OTG_HS_HOST_OTG_HS_HCINT11_STALL                   (0x1 << 3)    // STALL response received interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT11_NAK                     (0x1 << 4)    // NAK response received interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT11_ACK                     (0x1 << 5)    // ACK response received/transmitted interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT11_NYET                    (0x1 << 6)    // Response received interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT11_TXERR                   (0x1 << 7)    // Transaction error
#define  _OTG_HS_HOST_OTG_HS_HCINT11_BBERR                   (0x1 << 8)    // Babble error
#define  _OTG_HS_HOST_OTG_HS_HCINT11_FRMOR                   (0x1 << 9)    // Frame overrun
#define  _OTG_HS_HOST_OTG_HS_HCINT11_DTERR                   (0x1 << 10)    // Data toggle error
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK0_XFRCM                 (0x1 << 0)    // Transfer completed mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK0_CHHM                  (0x1 << 1)    // Channel halted mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK0_AHBERR                (0x1 << 2)    // AHB error
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK0_STALLM                (0x1 << 3)    // STALL response received interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK0_NAKM                  (0x1 << 4)    // NAK response received interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK0_ACKM                  (0x1 << 5)    // ACK response received/transmitted interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK0_NYET                  (0x1 << 6)    // response received interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK0_TXERRM                (0x1 << 7)    // Transaction error mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK0_BBERRM                (0x1 << 8)    // Babble error mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK0_FRMORM                (0x1 << 9)    // Frame overrun mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK0_DTERRM                (0x1 << 10)    // Data toggle error mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK1_XFRCM                 (0x1 << 0)    // Transfer completed mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK1_CHHM                  (0x1 << 1)    // Channel halted mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK1_AHBERR                (0x1 << 2)    // AHB error
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK1_STALLM                (0x1 << 3)    // STALL response received interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK1_NAKM                  (0x1 << 4)    // NAK response received interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK1_ACKM                  (0x1 << 5)    // ACK response received/transmitted interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK1_NYET                  (0x1 << 6)    // response received interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK1_TXERRM                (0x1 << 7)    // Transaction error mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK1_BBERRM                (0x1 << 8)    // Babble error mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK1_FRMORM                (0x1 << 9)    // Frame overrun mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK1_DTERRM                (0x1 << 10)    // Data toggle error mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK2_XFRCM                 (0x1 << 0)    // Transfer completed mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK2_CHHM                  (0x1 << 1)    // Channel halted mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK2_AHBERR                (0x1 << 2)    // AHB error
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK2_STALLM                (0x1 << 3)    // STALL response received interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK2_NAKM                  (0x1 << 4)    // NAK response received interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK2_ACKM                  (0x1 << 5)    // ACK response received/transmitted interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK2_NYET                  (0x1 << 6)    // response received interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK2_TXERRM                (0x1 << 7)    // Transaction error mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK2_BBERRM                (0x1 << 8)    // Babble error mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK2_FRMORM                (0x1 << 9)    // Frame overrun mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK2_DTERRM                (0x1 << 10)    // Data toggle error mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK3_XFRCM                 (0x1 << 0)    // Transfer completed mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK3_CHHM                  (0x1 << 1)    // Channel halted mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK3_AHBERR                (0x1 << 2)    // AHB error
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK3_STALLM                (0x1 << 3)    // STALL response received interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK3_NAKM                  (0x1 << 4)    // NAK response received interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK3_ACKM                  (0x1 << 5)    // ACK response received/transmitted interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK3_NYET                  (0x1 << 6)    // response received interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK3_TXERRM                (0x1 << 7)    // Transaction error mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK3_BBERRM                (0x1 << 8)    // Babble error mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK3_FRMORM                (0x1 << 9)    // Frame overrun mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK3_DTERRM                (0x1 << 10)    // Data toggle error mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK4_XFRCM                 (0x1 << 0)    // Transfer completed mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK4_CHHM                  (0x1 << 1)    // Channel halted mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK4_AHBERR                (0x1 << 2)    // AHB error
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK4_STALLM                (0x1 << 3)    // STALL response received interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK4_NAKM                  (0x1 << 4)    // NAK response received interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK4_ACKM                  (0x1 << 5)    // ACK response received/transmitted interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK4_NYET                  (0x1 << 6)    // response received interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK4_TXERRM                (0x1 << 7)    // Transaction error mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK4_BBERRM                (0x1 << 8)    // Babble error mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK4_FRMORM                (0x1 << 9)    // Frame overrun mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK4_DTERRM                (0x1 << 10)    // Data toggle error mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK5_XFRCM                 (0x1 << 0)    // Transfer completed mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK5_CHHM                  (0x1 << 1)    // Channel halted mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK5_AHBERR                (0x1 << 2)    // AHB error
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK5_STALLM                (0x1 << 3)    // STALL response received interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK5_NAKM                  (0x1 << 4)    // NAK response received interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK5_ACKM                  (0x1 << 5)    // ACK response received/transmitted interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK5_NYET                  (0x1 << 6)    // response received interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK5_TXERRM                (0x1 << 7)    // Transaction error mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK5_BBERRM                (0x1 << 8)    // Babble error mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK5_FRMORM                (0x1 << 9)    // Frame overrun mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK5_DTERRM                (0x1 << 10)    // Data toggle error mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK6_XFRCM                 (0x1 << 0)    // Transfer completed mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK6_CHHM                  (0x1 << 1)    // Channel halted mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK6_AHBERR                (0x1 << 2)    // AHB error
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK6_STALLM                (0x1 << 3)    // STALL response received interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK6_NAKM                  (0x1 << 4)    // NAK response received interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK6_ACKM                  (0x1 << 5)    // ACK response received/transmitted interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK6_NYET                  (0x1 << 6)    // response received interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK6_TXERRM                (0x1 << 7)    // Transaction error mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK6_BBERRM                (0x1 << 8)    // Babble error mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK6_FRMORM                (0x1 << 9)    // Frame overrun mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK6_DTERRM                (0x1 << 10)    // Data toggle error mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK7_XFRCM                 (0x1 << 0)    // Transfer completed mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK7_CHHM                  (0x1 << 1)    // Channel halted mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK7_AHBERR                (0x1 << 2)    // AHB error
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK7_STALLM                (0x1 << 3)    // STALL response received interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK7_NAKM                  (0x1 << 4)    // NAK response received interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK7_ACKM                  (0x1 << 5)    // ACK response received/transmitted interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK7_NYET                  (0x1 << 6)    // response received interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK7_TXERRM                (0x1 << 7)    // Transaction error mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK7_BBERRM                (0x1 << 8)    // Babble error mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK7_FRMORM                (0x1 << 9)    // Frame overrun mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK7_DTERRM                (0x1 << 10)    // Data toggle error mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK8_XFRCM                 (0x1 << 0)    // Transfer completed mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK8_CHHM                  (0x1 << 1)    // Channel halted mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK8_AHBERR                (0x1 << 2)    // AHB error
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK8_STALLM                (0x1 << 3)    // STALL response received interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK8_NAKM                  (0x1 << 4)    // NAK response received interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK8_ACKM                  (0x1 << 5)    // ACK response received/transmitted interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK8_NYET                  (0x1 << 6)    // response received interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK8_TXERRM                (0x1 << 7)    // Transaction error mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK8_BBERRM                (0x1 << 8)    // Babble error mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK8_FRMORM                (0x1 << 9)    // Frame overrun mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK8_DTERRM                (0x1 << 10)    // Data toggle error mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK9_XFRCM                 (0x1 << 0)    // Transfer completed mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK9_CHHM                  (0x1 << 1)    // Channel halted mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK9_AHBERR                (0x1 << 2)    // AHB error
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK9_STALLM                (0x1 << 3)    // STALL response received interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK9_NAKM                  (0x1 << 4)    // NAK response received interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK9_ACKM                  (0x1 << 5)    // ACK response received/transmitted interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK9_NYET                  (0x1 << 6)    // response received interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK9_TXERRM                (0x1 << 7)    // Transaction error mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK9_BBERRM                (0x1 << 8)    // Babble error mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK9_FRMORM                (0x1 << 9)    // Frame overrun mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK9_DTERRM                (0x1 << 10)    // Data toggle error mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK10_XFRCM                (0x1 << 0)    // Transfer completed mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK10_CHHM                 (0x1 << 1)    // Channel halted mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK10_AHBERR               (0x1 << 2)    // AHB error
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK10_STALLM               (0x1 << 3)    // STALL response received interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK10_NAKM                 (0x1 << 4)    // NAK response received interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK10_ACKM                 (0x1 << 5)    // ACK response received/transmitted interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK10_NYET                 (0x1 << 6)    // response received interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK10_TXERRM               (0x1 << 7)    // Transaction error mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK10_BBERRM               (0x1 << 8)    // Babble error mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK10_FRMORM               (0x1 << 9)    // Frame overrun mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK10_DTERRM               (0x1 << 10)    // Data toggle error mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK11_XFRCM                (0x1 << 0)    // Transfer completed mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK11_CHHM                 (0x1 << 1)    // Channel halted mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK11_AHBERR               (0x1 << 2)    // AHB error
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK11_STALLM               (0x1 << 3)    // STALL response received interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK11_NAKM                 (0x1 << 4)    // NAK response received interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK11_ACKM                 (0x1 << 5)    // ACK response received/transmitted interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK11_NYET                 (0x1 << 6)    // response received interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK11_TXERRM               (0x1 << 7)    // Transaction error mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK11_BBERRM               (0x1 << 8)    // Babble error mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK11_FRMORM               (0x1 << 9)    // Frame overrun mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK11_DTERRM               (0x1 << 10)    // Data toggle error mask
#define  _OTG_HS_HOST_OTG_HS_HCTSIZ0_XFRSIZ                  (0x7ffff << 0)    // Transfer size
#define  _OTG_HS_HOST_OTG_HS_HCTSIZ0_PKTCNT                  (0x3ff << 19)    // Packet count
#define  _OTG_HS_HOST_OTG_HS_HCTSIZ0_DPID                    (0x3 << 29)    // Data PID
#define  _OTG_HS_HOST_OTG_HS_HCTSIZ1_XFRSIZ                  (0x7ffff << 0)    // Transfer size
#define  _OTG_HS_HOST_OTG_HS_HCTSIZ1_PKTCNT                  (0x3ff << 19)    // Packet count
#define  _OTG_HS_HOST_OTG_HS_HCTSIZ1_DPID                    (0x3 << 29)    // Data PID
#define  _OTG_HS_HOST_OTG_HS_HCTSIZ2_XFRSIZ                  (0x7ffff << 0)    // Transfer size
#define  _OTG_HS_HOST_OTG_HS_HCTSIZ2_PKTCNT                  (0x3ff << 19)    // Packet count
#define  _OTG_HS_HOST_OTG_HS_HCTSIZ2_DPID                    (0x3 << 29)    // Data PID
#define  _OTG_HS_HOST_OTG_HS_HCTSIZ3_XFRSIZ                  (0x7ffff << 0)    // Transfer size
#define  _OTG_HS_HOST_OTG_HS_HCTSIZ3_PKTCNT                  (0x3ff << 19)    // Packet count
#define  _OTG_HS_HOST_OTG_HS_HCTSIZ3_DPID                    (0x3 << 29)    // Data PID
#define  _OTG_HS_HOST_OTG_HS_HCTSIZ4_XFRSIZ                  (0x7ffff << 0)    // Transfer size
#define  _OTG_HS_HOST_OTG_HS_HCTSIZ4_PKTCNT                  (0x3ff << 19)    // Packet count
#define  _OTG_HS_HOST_OTG_HS_HCTSIZ4_DPID                    (0x3 << 29)    // Data PID
#define  _OTG_HS_HOST_OTG_HS_HCTSIZ5_XFRSIZ                  (0x7ffff << 0)    // Transfer size
#define  _OTG_HS_HOST_OTG_HS_HCTSIZ5_PKTCNT                  (0x3ff << 19)    // Packet count
#define  _OTG_HS_HOST_OTG_HS_HCTSIZ5_DPID                    (0x3 << 29)    // Data PID
#define  _OTG_HS_HOST_OTG_HS_HCTSIZ6_XFRSIZ                  (0x7ffff << 0)    // Transfer size
#define  _OTG_HS_HOST_OTG_HS_HCTSIZ6_PKTCNT                  (0x3ff << 19)    // Packet count
#define  _OTG_HS_HOST_OTG_HS_HCTSIZ6_DPID                    (0x3 << 29)    // Data PID
#define  _OTG_HS_HOST_OTG_HS_HCTSIZ7_XFRSIZ                  (0x7ffff << 0)    // Transfer size
#define  _OTG_HS_HOST_OTG_HS_HCTSIZ7_PKTCNT                  (0x3ff << 19)    // Packet count
#define  _OTG_HS_HOST_OTG_HS_HCTSIZ7_DPID                    (0x3 << 29)    // Data PID
#define  _OTG_HS_HOST_OTG_HS_HCTSIZ8_XFRSIZ                  (0x7ffff << 0)    // Transfer size
#define  _OTG_HS_HOST_OTG_HS_HCTSIZ8_PKTCNT                  (0x3ff << 19)    // Packet count
#define  _OTG_HS_HOST_OTG_HS_HCTSIZ8_DPID                    (0x3 << 29)    // Data PID
#define  _OTG_HS_HOST_OTG_HS_HCTSIZ9_XFRSIZ                  (0x7ffff << 0)    // Transfer size
#define  _OTG_HS_HOST_OTG_HS_HCTSIZ9_PKTCNT                  (0x3ff << 19)    // Packet count
#define  _OTG_HS_HOST_OTG_HS_HCTSIZ9_DPID                    (0x3 << 29)    // Data PID
#define  _OTG_HS_HOST_OTG_HS_HCTSIZ10_XFRSIZ                 (0x7ffff << 0)    // Transfer size
#define  _OTG_HS_HOST_OTG_HS_HCTSIZ10_PKTCNT                 (0x3ff << 19)    // Packet count
#define  _OTG_HS_HOST_OTG_HS_HCTSIZ10_DPID                   (0x3 << 29)    // Data PID
#define  _OTG_HS_HOST_OTG_HS_HCTSIZ11_XFRSIZ                 (0x7ffff << 0)    // Transfer size
#define  _OTG_HS_HOST_OTG_HS_HCTSIZ11_PKTCNT                 (0x3ff << 19)    // Packet count
#define  _OTG_HS_HOST_OTG_HS_HCTSIZ11_DPID                   (0x3 << 29)    // Data PID
#define  _OTG_HS_HOST_OTG_HS_HCDMA0_DMAADDR                  (0xffffffff << 0)    // DMA address
#define  _OTG_HS_HOST_OTG_HS_HCDMA1_DMAADDR                  (0xffffffff << 0)    // DMA address
#define  _OTG_HS_HOST_OTG_HS_HCDMA2_DMAADDR                  (0xffffffff << 0)    // DMA address
#define  _OTG_HS_HOST_OTG_HS_HCDMA3_DMAADDR                  (0xffffffff << 0)    // DMA address
#define  _OTG_HS_HOST_OTG_HS_HCDMA4_DMAADDR                  (0xffffffff << 0)    // DMA address
#define  _OTG_HS_HOST_OTG_HS_HCDMA5_DMAADDR                  (0xffffffff << 0)    // DMA address
#define  _OTG_HS_HOST_OTG_HS_HCDMA6_DMAADDR                  (0xffffffff << 0)    // DMA address
#define  _OTG_HS_HOST_OTG_HS_HCDMA7_DMAADDR                  (0xffffffff << 0)    // DMA address
#define  _OTG_HS_HOST_OTG_HS_HCDMA8_DMAADDR                  (0xffffffff << 0)    // DMA address
#define  _OTG_HS_HOST_OTG_HS_HCDMA9_DMAADDR                  (0xffffffff << 0)    // DMA address
#define  _OTG_HS_HOST_OTG_HS_HCDMA10_DMAADDR                 (0xffffffff << 0)    // DMA address
#define  _OTG_HS_HOST_OTG_HS_HCDMA11_DMAADDR                 (0xffffffff << 0)    // DMA address
#define  _OTG_HS_HOST_OTG_HS_HCCHAR12_MPSIZ                  (0x7ff << 0)    // Maximum packet size
#define  _OTG_HS_HOST_OTG_HS_HCCHAR12_EPNUM                  (0xf << 11)    // Endpoint number
#define  _OTG_HS_HOST_OTG_HS_HCCHAR12_EPDIR                  (0x1 << 15)    // Endpoint direction
#define  _OTG_HS_HOST_OTG_HS_HCCHAR12_LSDEV                  (0x1 << 17)    // Low-speed device
#define  _OTG_HS_HOST_OTG_HS_HCCHAR12_EPTYP                  (0x3 << 18)    // Endpoint type
#define  _OTG_HS_HOST_OTG_HS_HCCHAR12_MC                     (0x3 << 20)    // Multi Count (MC) / Error Count (EC)
#define  _OTG_HS_HOST_OTG_HS_HCCHAR12_DAD                    (0x7f << 22)    // Device address
#define  _OTG_HS_HOST_OTG_HS_HCCHAR12_ODDFRM                 (0x1 << 29)    // Odd frame
#define  _OTG_HS_HOST_OTG_HS_HCCHAR12_CHDIS                  (0x1 << 30)    // Channel disable
#define  _OTG_HS_HOST_OTG_HS_HCCHAR12_CHENA                  (0x1 << 31)    // Channel enable
#define  _OTG_HS_HOST_OTG_HS_HCSPLT12_PRTADDR                (0x7f << 0)    // Port address
#define  _OTG_HS_HOST_OTG_HS_HCSPLT12_HUBADDR                (0x7f << 7)    // Hub address
#define  _OTG_HS_HOST_OTG_HS_HCSPLT12_XACTPOS                (0x3 << 14)    // XACTPOS
#define  _OTG_HS_HOST_OTG_HS_HCSPLT12_COMPLSPLT              (0x1 << 16)    // Do complete split
#define  _OTG_HS_HOST_OTG_HS_HCSPLT12_SPLITEN                (0x1 << 31)    // Split enable
#define  _OTG_HS_HOST_OTG_HS_HCINT12_XFRC                    (0x1 << 0)    // Transfer completed
#define  _OTG_HS_HOST_OTG_HS_HCINT12_CHH                     (0x1 << 1)    // Channel halted
#define  _OTG_HS_HOST_OTG_HS_HCINT12_AHBERR                  (0x1 << 2)    // AHB error
#define  _OTG_HS_HOST_OTG_HS_HCINT12_STALL                   (0x1 << 3)    // STALL response received interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT12_NAK                     (0x1 << 4)    // NAK response received interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT12_ACK                     (0x1 << 5)    // ACK response received/transmitted interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT12_NYET                    (0x1 << 6)    // Response received interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT12_TXERR                   (0x1 << 7)    // Transaction error
#define  _OTG_HS_HOST_OTG_HS_HCINT12_BBERR                   (0x1 << 8)    // Babble error
#define  _OTG_HS_HOST_OTG_HS_HCINT12_FRMOR                   (0x1 << 9)    // Frame overrun
#define  _OTG_HS_HOST_OTG_HS_HCINT12_DTERR                   (0x1 << 10)    // Data toggle error
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK12_XFRCM                (0x1 << 0)    // Transfer completed mask
