7h3qu1rkyb1t/stm32f7-drivers/drivers/inc/stm32f767xx_USB_OTG_HS.h
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK12_CHHM                 (0x1 << 1)    // Channel halted mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK12_AHBERR               (0x1 << 2)    // AHB error
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK12_STALLM               (0x1 << 3)    // STALL response received interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK12_NAKM                 (0x1 << 4)    // NAK response received interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK12_ACKM                 (0x1 << 5)    // ACK response received/transmitted interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK12_NYET                 (0x1 << 6)    // Response received interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK12_TXERRM               (0x1 << 7)    // Transaction error
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK12_BBERRM               (0x1 << 8)    // Babble error
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK12_FRMORM               (0x1 << 9)    // Frame overrun mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK12_DTERRM               (0x1 << 10)    // Data toggle error mask
#define  _OTG_HS_HOST_OTG_HS_HCTSIZ12_XFRSIZ                 (0x7ffff << 0)    // Transfer size
#define  _OTG_HS_HOST_OTG_HS_HCTSIZ12_PKTCNT                 (0x3ff << 19)    // Packet count
#define  _OTG_HS_HOST_OTG_HS_HCTSIZ12_DPID                   (0x3 << 29)    // Data PID
#define  _OTG_HS_HOST_OTG_HS_HCDMA12_DMAADDR                 (0xffffffff << 0)    // DMA address
#define  _OTG_HS_HOST_OTG_HS_HCCHAR13_MPSIZ                  (0x7ff << 0)    // Maximum packet size
#define  _OTG_HS_HOST_OTG_HS_HCCHAR13_EPNUM                  (0xf << 11)    // Endpoint number
#define  _OTG_HS_HOST_OTG_HS_HCCHAR13_EPDIR                  (0x1 << 15)    // Endpoint direction
#define  _OTG_HS_HOST_OTG_HS_HCCHAR13_LSDEV                  (0x1 << 17)    // Low-speed device
#define  _OTG_HS_HOST_OTG_HS_HCCHAR13_EPTYP                  (0x3 << 18)    // Endpoint type
#define  _OTG_HS_HOST_OTG_HS_HCCHAR13_MC                     (0x3 << 20)    // Multi Count (MC) / Error Count (EC)
#define  _OTG_HS_HOST_OTG_HS_HCCHAR13_DAD                    (0x7f << 22)    // Device address
#define  _OTG_HS_HOST_OTG_HS_HCCHAR13_ODDFRM                 (0x1 << 29)    // Odd frame
#define  _OTG_HS_HOST_OTG_HS_HCCHAR13_CHDIS                  (0x1 << 30)    // Channel disable
#define  _OTG_HS_HOST_OTG_HS_HCCHAR13_CHENA                  (0x1 << 31)    // Channel enable
#define  _OTG_HS_HOST_OTG_HS_HCSPLT13_PRTADDR                (0x7f << 0)    // Port address
#define  _OTG_HS_HOST_OTG_HS_HCSPLT13_HUBADDR                (0x7f << 7)    // Hub address
#define  _OTG_HS_HOST_OTG_HS_HCSPLT13_XACTPOS                (0x3 << 14)    // XACTPOS
#define  _OTG_HS_HOST_OTG_HS_HCSPLT13_COMPLSPLT              (0x1 << 16)    // Do complete split
#define  _OTG_HS_HOST_OTG_HS_HCSPLT13_SPLITEN                (0x1 << 31)    // Split enable
#define  _OTG_HS_HOST_OTG_HS_HCINT13_XFRC                    (0x1 << 0)    // Transfer completed
#define  _OTG_HS_HOST_OTG_HS_HCINT13_CHH                     (0x1 << 1)    // Channel halted
#define  _OTG_HS_HOST_OTG_HS_HCINT13_AHBERR                  (0x1 << 2)    // AHB error
#define  _OTG_HS_HOST_OTG_HS_HCINT13_STALL                   (0x1 << 3)    // STALL response received interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT13_NAK                     (0x1 << 4)    // NAK response received interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT13_ACK                     (0x1 << 5)    // ACK response received/transmitted interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT13_NYET                    (0x1 << 6)    // Response received interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT13_TXERR                   (0x1 << 7)    // Transaction error
#define  _OTG_HS_HOST_OTG_HS_HCINT13_BBERR                   (0x1 << 8)    // Babble error
#define  _OTG_HS_HOST_OTG_HS_HCINT13_FRMOR                   (0x1 << 9)    // Frame overrun
#define  _OTG_HS_HOST_OTG_HS_HCINT13_DTERR                   (0x1 << 10)    // Data toggle error
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK13_XFRCM                (0x1 << 0)    // Transfer completed mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK13_CHHM                 (0x1 << 1)    // Channel halted mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK13_AHBERR               (0x1 << 2)    // AHB error
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK13_STALLM               (0x1 << 3)    // STALLM response received interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK13_NAKM                 (0x1 << 4)    // NAK response received interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK13_ACKM                 (0x1 << 5)    // ACK response received/transmitted interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK13_NYET                 (0x1 << 6)    // Response received interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK13_TXERRM               (0x1 << 7)    // Transaction error
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK13_BBERRM               (0x1 << 8)    // Babble error
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK13_FRMORM               (0x1 << 9)    // Frame overrun mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK13_DTERRM               (0x1 << 10)    // Data toggle error mask
#define  _OTG_HS_HOST_OTG_HS_HCTSIZ13_XFRSIZ                 (0x7ffff << 0)    // Transfer size
#define  _OTG_HS_HOST_OTG_HS_HCTSIZ13_PKTCNT                 (0x3ff << 19)    // Packet count
#define  _OTG_HS_HOST_OTG_HS_HCTSIZ13_DPID                   (0x3 << 29)    // Data PID
#define  _OTG_HS_HOST_OTG_HS_HCDMA13_DMAADDR                 (0xffffffff << 0)    // DMA address
#define  _OTG_HS_HOST_OTG_HS_HCCHAR14_MPSIZ                  (0x7ff << 0)    // Maximum packet size
#define  _OTG_HS_HOST_OTG_HS_HCCHAR14_EPNUM                  (0xf << 11)    // Endpoint number
#define  _OTG_HS_HOST_OTG_HS_HCCHAR14_EPDIR                  (0x1 << 15)    // Endpoint direction
#define  _OTG_HS_HOST_OTG_HS_HCCHAR14_LSDEV                  (0x1 << 17)    // Low-speed device
#define  _OTG_HS_HOST_OTG_HS_HCCHAR14_EPTYP                  (0x3 << 18)    // Endpoint type
#define  _OTG_HS_HOST_OTG_HS_HCCHAR14_MC                     (0x3 << 20)    // Multi Count (MC) / Error Count (EC)
#define  _OTG_HS_HOST_OTG_HS_HCCHAR14_DAD                    (0x7f << 22)    // Device address
#define  _OTG_HS_HOST_OTG_HS_HCCHAR14_ODDFRM                 (0x1 << 29)    // Odd frame
#define  _OTG_HS_HOST_OTG_HS_HCCHAR14_CHDIS                  (0x1 << 30)    // Channel disable
#define  _OTG_HS_HOST_OTG_HS_HCCHAR14_CHENA                  (0x1 << 31)    // Channel enable
#define  _OTG_HS_HOST_OTG_HS_HCSPLT14_PRTADDR                (0x7f << 0)    // Port address
#define  _OTG_HS_HOST_OTG_HS_HCSPLT14_HUBADDR                (0x7f << 7)    // Hub address
#define  _OTG_HS_HOST_OTG_HS_HCSPLT14_XACTPOS                (0x3 << 14)    // XACTPOS
#define  _OTG_HS_HOST_OTG_HS_HCSPLT14_COMPLSPLT              (0x1 << 16)    // Do complete split
#define  _OTG_HS_HOST_OTG_HS_HCSPLT14_SPLITEN                (0x1 << 31)    // Split enable
#define  _OTG_HS_HOST_OTG_HS_HCINT14_XFRC                    (0x1 << 0)    // Transfer completed
#define  _OTG_HS_HOST_OTG_HS_HCINT14_CHH                     (0x1 << 1)    // Channel halted
#define  _OTG_HS_HOST_OTG_HS_HCINT14_AHBERR                  (0x1 << 2)    // AHB error
#define  _OTG_HS_HOST_OTG_HS_HCINT14_STALL                   (0x1 << 3)    // STALL response received interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT14_NAK                     (0x1 << 4)    // NAK response received interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT14_ACK                     (0x1 << 5)    // ACK response received/transmitted interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT14_NYET                    (0x1 << 6)    // Response received interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT14_TXERR                   (0x1 << 7)    // Transaction error
#define  _OTG_HS_HOST_OTG_HS_HCINT14_BBERR                   (0x1 << 8)    // Babble error
#define  _OTG_HS_HOST_OTG_HS_HCINT14_FRMOR                   (0x1 << 9)    // Frame overrun
#define  _OTG_HS_HOST_OTG_HS_HCINT14_DTERR                   (0x1 << 10)    // Data toggle error
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK14_XFRCM                (0x1 << 0)    // Transfer completed mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK14_CHHM                 (0x1 << 1)    // Channel halted mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK14_AHBERR               (0x1 << 2)    // AHB error
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK14_STALLM               (0x1 << 3)    // STALL response received interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK14_NAKM                 (0x1 << 4)    // NAKM response received interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK14_ACKM                 (0x1 << 5)    // ACKM response received/transmitted interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK14_NYET                 (0x1 << 6)    // Response received interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK14_TXERRM               (0x1 << 7)    // Transaction error
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK14_BBERRM               (0x1 << 8)    // Babble error
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK14_FRMORM               (0x1 << 9)    // Frame overrun mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK14_DTERRM               (0x1 << 10)    // Data toggle error mask
#define  _OTG_HS_HOST_OTG_HS_HCTSIZ14_XFRSIZ                 (0x7ffff << 0)    // Transfer size
#define  _OTG_HS_HOST_OTG_HS_HCTSIZ14_PKTCNT                 (0x3ff << 19)    // Packet count
#define  _OTG_HS_HOST_OTG_HS_HCTSIZ14_DPID                   (0x3 << 29)    // Data PID
#define  _OTG_HS_HOST_OTG_HS_HCDMA14_DMAADDR                 (0xffffffff << 0)    // DMA address
#define  _OTG_HS_HOST_OTG_HS_HCCHAR15_MPSIZ                  (0x7ff << 0)    // Maximum packet size
#define  _OTG_HS_HOST_OTG_HS_HCCHAR15_EPNUM                  (0xf << 11)    // Endpoint number
#define  _OTG_HS_HOST_OTG_HS_HCCHAR15_EPDIR                  (0x1 << 15)    // Endpoint direction
#define  _OTG_HS_HOST_OTG_HS_HCCHAR15_LSDEV                  (0x1 << 17)    // Low-speed device
#define  _OTG_HS_HOST_OTG_HS_HCCHAR15_EPTYP                  (0x3 << 18)    // Endpoint type
#define  _OTG_HS_HOST_OTG_HS_HCCHAR15_MC                     (0x3 << 20)    // Multi Count (MC) / Error Count (EC)
#define  _OTG_HS_HOST_OTG_HS_HCCHAR15_DAD                    (0x7f << 22)    // Device address
#define  _OTG_HS_HOST_OTG_HS_HCCHAR15_ODDFRM                 (0x1 << 29)    // Odd frame
#define  _OTG_HS_HOST_OTG_HS_HCCHAR15_CHDIS                  (0x1 << 30)    // Channel disable
#define  _OTG_HS_HOST_OTG_HS_HCCHAR15_CHENA                  (0x1 << 31)    // Channel enable
#define  _OTG_HS_HOST_OTG_HS_HCSPLT15_PRTADDR                (0x7f << 0)    // Port address
#define  _OTG_HS_HOST_OTG_HS_HCSPLT15_HUBADDR                (0x7f << 7)    // Hub address
#define  _OTG_HS_HOST_OTG_HS_HCSPLT15_XACTPOS                (0x3 << 14)    // XACTPOS
#define  _OTG_HS_HOST_OTG_HS_HCSPLT15_COMPLSPLT              (0x1 << 16)    // Do complete split
#define  _OTG_HS_HOST_OTG_HS_HCSPLT15_SPLITEN                (0x1 << 31)    // Split enable
#define  _OTG_HS_HOST_OTG_HS_HCINT15_XFRC                    (0x1 << 0)    // Transfer completed
#define  _OTG_HS_HOST_OTG_HS_HCINT15_CHH                     (0x1 << 1)    // Channel halted
#define  _OTG_HS_HOST_OTG_HS_HCINT15_AHBERR                  (0x1 << 2)    // AHB error
#define  _OTG_HS_HOST_OTG_HS_HCINT15_STALL                   (0x1 << 3)    // STALL response received interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT15_NAK                     (0x1 << 4)    // NAK response received interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT15_ACK                     (0x1 << 5)    // ACK response received/transmitted interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT15_NYET                    (0x1 << 6)    // Response received interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINT15_TXERR                   (0x1 << 7)    // Transaction error
#define  _OTG_HS_HOST_OTG_HS_HCINT15_BBERR                   (0x1 << 8)    // Babble error
#define  _OTG_HS_HOST_OTG_HS_HCINT15_FRMOR                   (0x1 << 9)    // Frame overrun
#define  _OTG_HS_HOST_OTG_HS_HCINT15_DTERR                   (0x1 << 10)    // Data toggle error
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK15_XFRCM                (0x1 << 0)    // Transfer completed mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK15_CHHM                 (0x1 << 1)    // Channel halted mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK15_AHBERR               (0x1 << 2)    // AHB error
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK15_STALL                (0x1 << 3)    // STALL response received interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK15_NAKM                 (0x1 << 4)    // NAK response received interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK15_ACKM                 (0x1 << 5)    // ACK response received/transmitted interrupt mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK15_NYET                 (0x1 << 6)    // Response received interrupt
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK15_TXERRM               (0x1 << 7)    // Transaction error
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK15_BBERRM               (0x1 << 8)    // Babble error
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK15_FRMORM               (0x1 << 9)    // Frame overrun mask
#define  _OTG_HS_HOST_OTG_HS_HCINTMSK15_DTERRM               (0x1 << 10)    // Data toggle error mask
#define  _OTG_HS_HOST_OTG_HS_HCTSIZ15_XFRSIZ                 (0x7ffff << 0)    // Transfer size
#define  _OTG_HS_HOST_OTG_HS_HCTSIZ15_PKTCNT                 (0x3ff << 19)    // Packet count
#define  _OTG_HS_HOST_OTG_HS_HCTSIZ15_DPID                   (0x3 << 29)    // Data PID
#define  _OTG_HS_HOST_OTG_HS_HCDMA15_DMAADDR                 (0xffffffff << 0)    // DMA address
#define  _OTG_HS_DEVICE_OTG_HS_DCFG_DSPD                     (0x3 << 0)    // Device speed
#define  _OTG_HS_DEVICE_OTG_HS_DCFG_NZLSOHSK                 (0x1 << 2)    // Nonzero-length status OUT handshake
#define  _OTG_HS_DEVICE_OTG_HS_DCFG_DAD                      (0x7f << 4)    // Device address
#define  _OTG_HS_DEVICE_OTG_HS_DCFG_PFIVL                    (0x3 << 11)    // Periodic (micro)frame interval
#define  _OTG_HS_DEVICE_OTG_HS_DCFG_PERSCHIVL                (0x3 << 24)    // Periodic scheduling interval
#define  _OTG_HS_DEVICE_OTG_HS_DCTL_RWUSIG                   (0x1 << 0)    // Remote wakeup signaling
#define  _OTG_HS_DEVICE_OTG_HS_DCTL_SDIS                     (0x1 << 1)    // Soft disconnect
#define  _OTG_HS_DEVICE_OTG_HS_DCTL_GINSTS                   (0x1 << 2)    // Global IN NAK status
#define  _OTG_HS_DEVICE_OTG_HS_DCTL_GONSTS                   (0x1 << 3)    // Global OUT NAK status
#define  _OTG_HS_DEVICE_OTG_HS_DCTL_TCTL                     (0x7 << 4)    // Test control
#define  _OTG_HS_DEVICE_OTG_HS_DCTL_SGINAK                   (0x1 << 7)    // Set global IN NAK
#define  _OTG_HS_DEVICE_OTG_HS_DCTL_CGINAK                   (0x1 << 8)    // Clear global IN NAK
#define  _OTG_HS_DEVICE_OTG_HS_DCTL_SGONAK                   (0x1 << 9)    // Set global OUT NAK
#define  _OTG_HS_DEVICE_OTG_HS_DCTL_CGONAK                   (0x1 << 10)    // Clear global OUT NAK
#define  _OTG_HS_DEVICE_OTG_HS_DCTL_POPRGDNE                 (0x1 << 11)    // Power-on programming done
#define  _OTG_HS_DEVICE_OTG_HS_DSTS_SUSPSTS                  (0x1 << 0)    // Suspend status
#define  _OTG_HS_DEVICE_OTG_HS_DSTS_ENUMSPD                  (0x3 << 1)    // Enumerated speed
#define  _OTG_HS_DEVICE_OTG_HS_DSTS_EERR                     (0x1 << 3)    // Erratic error
#define  _OTG_HS_DEVICE_OTG_HS_DSTS_FNSOF                    (0x3fff << 8)    // Frame number of the received SOF
#define  _OTG_HS_DEVICE_OTG_HS_DIEPMSK_XFRCM                 (0x1 << 0)    // Transfer completed interrupt mask
#define  _OTG_HS_DEVICE_OTG_HS_DIEPMSK_EPDM                  (0x1 << 1)    // Endpoint disabled interrupt mask
#define  _OTG_HS_DEVICE_OTG_HS_DIEPMSK_TOM                   (0x1 << 3)    // Timeout condition mask (nonisochronous endpoints)
#define  _OTG_HS_DEVICE_OTG_HS_DIEPMSK_ITTXFEMSK             (0x1 << 4)    // IN token received when TxFIFO empty mask
#define  _OTG_HS_DEVICE_OTG_HS_DIEPMSK_INEPNMM               (0x1 << 5)    // IN token received with EP mismatch mask
#define  _OTG_HS_DEVICE_OTG_HS_DIEPMSK_INEPNEM               (0x1 << 6)    // IN endpoint NAK effective mask
#define  _OTG_HS_DEVICE_OTG_HS_DIEPMSK_TXFURM                (0x1 << 8)    // FIFO underrun mask
#define  _OTG_HS_DEVICE_OTG_HS_DIEPMSK_BIM                   (0x1 << 9)    // BNA interrupt mask
#define  _OTG_HS_DEVICE_OTG_HS_DOEPMSK_XFRCM                 (0x1 << 0)    // Transfer completed interrupt mask
#define  _OTG_HS_DEVICE_OTG_HS_DOEPMSK_EPDM                  (0x1 << 1)    // Endpoint disabled interrupt mask
#define  _OTG_HS_DEVICE_OTG_HS_DOEPMSK_STUPM                 (0x1 << 3)    // SETUP phase done mask
#define  _OTG_HS_DEVICE_OTG_HS_DOEPMSK_OTEPDM                (0x1 << 4)    // OUT token received when endpoint disabled mask
#define  _OTG_HS_DEVICE_OTG_HS_DOEPMSK_B2BSTUP               (0x1 << 6)    // Back-to-back SETUP packets received mask
#define  _OTG_HS_DEVICE_OTG_HS_DOEPMSK_OPEM                  (0x1 << 8)    // OUT packet error mask
#define  _OTG_HS_DEVICE_OTG_HS_DOEPMSK_BOIM                  (0x1 << 9)    // BNA interrupt mask
#define  _OTG_HS_DEVICE_OTG_HS_DAINT_IEPINT                  (0xffff << 0)    // IN endpoint interrupt bits
#define  _OTG_HS_DEVICE_OTG_HS_DAINT_OEPINT                  (0xffff << 16)    // OUT endpoint interrupt bits
#define  _OTG_HS_DEVICE_OTG_HS_DAINTMSK_IEPM                 (0xffff << 0)    // IN EP interrupt mask bits
#define  _OTG_HS_DEVICE_OTG_HS_DAINTMSK_OEPM                 (0xffff << 16)    // OUT EP interrupt mask bits
#define  _OTG_HS_DEVICE_OTG_HS_DVBUSDIS_VBUSDT               (0xffff << 0)    // Device VBUS discharge time
#define  _OTG_HS_DEVICE_OTG_HS_DVBUSPULSE_DVBUSP             (0xfff << 0)    // Device VBUS pulsing time
#define  _OTG_HS_DEVICE_OTG_HS_DTHRCTL_NONISOTHREN           (0x1 << 0)    // Nonisochronous IN endpoints threshold enable
#define  _OTG_HS_DEVICE_OTG_HS_DTHRCTL_ISOTHREN              (0x1 << 1)    // ISO IN endpoint threshold enable
#define  _OTG_HS_DEVICE_OTG_HS_DTHRCTL_TXTHRLEN              (0x1ff << 2)    // Transmit threshold length
#define  _OTG_HS_DEVICE_OTG_HS_DTHRCTL_RXTHREN               (0x1 << 16)    // Receive threshold enable
#define  _OTG_HS_DEVICE_OTG_HS_DTHRCTL_RXTHRLEN              (0x1ff << 17)    // Receive threshold length
#define  _OTG_HS_DEVICE_OTG_HS_DTHRCTL_ARPEN                 (0x1 << 27)    // Arbiter parking enable
#define  _OTG_HS_DEVICE_OTG_HS_DIEPEMPMSK_INEPTXFEM          (0xffff << 0)    // IN EP Tx FIFO empty interrupt mask bits
#define  _OTG_HS_DEVICE_OTG_HS_DEACHINT_IEP1INT              (0x1 << 1)    // IN endpoint 1interrupt bit
#define  _OTG_HS_DEVICE_OTG_HS_DEACHINT_OEP1INT              (0x1 << 17)    // OUT endpoint 1 interrupt bit
#define  _OTG_HS_DEVICE_OTG_HS_DEACHINTMSK_IEP1INTM          (0x1 << 1)    // IN Endpoint 1 interrupt mask bit
#define  _OTG_HS_DEVICE_OTG_HS_DEACHINTMSK_OEP1INTM          (0x1 << 17)    // OUT Endpoint 1 interrupt mask bit
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL0_MPSIZ                (0x7ff << 0)    // Maximum packet size
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL0_USBAEP               (0x1 << 15)    // USB active endpoint
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL0_EONUM_DPID           (0x1 << 16)    // Even/odd frame
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL0_NAKSTS               (0x1 << 17)    // NAK status
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL0_EPTYP                (0x3 << 18)    // Endpoint type
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL0_Stall                (0x1 << 21)    // STALL handshake
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL0_TXFNUM               (0xf << 22)    // TxFIFO number
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL0_CNAK                 (0x1 << 26)    // Clear NAK
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL0_SNAK                 (0x1 << 27)    // Set NAK
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL0_SD0PID_SEVNFRM       (0x1 << 28)    // Set DATA0 PID
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL0_SODDFRM              (0x1 << 29)    // Set odd frame
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL0_EPDIS                (0x1 << 30)    // Endpoint disable
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL0_EPENA                (0x1 << 31)    // Endpoint enable
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL1_MPSIZ                (0x7ff << 0)    // Maximum packet size
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL1_USBAEP               (0x1 << 15)    // USB active endpoint
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL1_EONUM_DPID           (0x1 << 16)    // Even/odd frame
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL1_NAKSTS               (0x1 << 17)    // NAK status
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL1_EPTYP                (0x3 << 18)    // Endpoint type
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL1_Stall                (0x1 << 21)    // STALL handshake
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL1_TXFNUM               (0xf << 22)    // TxFIFO number
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL1_CNAK                 (0x1 << 26)    // Clear NAK
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL1_SNAK                 (0x1 << 27)    // Set NAK
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL1_SD0PID_SEVNFRM       (0x1 << 28)    // Set DATA0 PID
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL1_SODDFRM              (0x1 << 29)    // Set odd frame
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL1_EPDIS                (0x1 << 30)    // Endpoint disable
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL1_EPENA                (0x1 << 31)    // Endpoint enable
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL2_MPSIZ                (0x7ff << 0)    // Maximum packet size
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL2_USBAEP               (0x1 << 15)    // USB active endpoint
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL2_EONUM_DPID           (0x1 << 16)    // Even/odd frame
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL2_NAKSTS               (0x1 << 17)    // NAK status
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL2_EPTYP                (0x3 << 18)    // Endpoint type
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL2_Stall                (0x1 << 21)    // STALL handshake
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL2_TXFNUM               (0xf << 22)    // TxFIFO number
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL2_CNAK                 (0x1 << 26)    // Clear NAK
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL2_SNAK                 (0x1 << 27)    // Set NAK
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL2_SD0PID_SEVNFRM       (0x1 << 28)    // Set DATA0 PID
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL2_SODDFRM              (0x1 << 29)    // Set odd frame
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL2_EPDIS                (0x1 << 30)    // Endpoint disable
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL2_EPENA                (0x1 << 31)    // Endpoint enable
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL3_MPSIZ                (0x7ff << 0)    // Maximum packet size
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL3_USBAEP               (0x1 << 15)    // USB active endpoint
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL3_EONUM_DPID           (0x1 << 16)    // Even/odd frame
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL3_NAKSTS               (0x1 << 17)    // NAK status
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL3_EPTYP                (0x3 << 18)    // Endpoint type
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL3_Stall                (0x1 << 21)    // STALL handshake
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL3_TXFNUM               (0xf << 22)    // TxFIFO number
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL3_CNAK                 (0x1 << 26)    // Clear NAK
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL3_SNAK                 (0x1 << 27)    // Set NAK
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL3_SD0PID_SEVNFRM       (0x1 << 28)    // Set DATA0 PID
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL3_SODDFRM              (0x1 << 29)    // Set odd frame
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL3_EPDIS                (0x1 << 30)    // Endpoint disable
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL3_EPENA                (0x1 << 31)    // Endpoint enable
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL4_MPSIZ                (0x7ff << 0)    // Maximum packet size
