7h3qu1rkyb1t/stm32f7-drivers/drivers/inc/stm32f767xx_USB_OTG_HS.h
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL4_USBAEP               (0x1 << 15)    // USB active endpoint
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL4_EONUM_DPID           (0x1 << 16)    // Even/odd frame
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL4_NAKSTS               (0x1 << 17)    // NAK status
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL4_EPTYP                (0x3 << 18)    // Endpoint type
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL4_Stall                (0x1 << 21)    // STALL handshake
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL4_TXFNUM               (0xf << 22)    // TxFIFO number
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL4_CNAK                 (0x1 << 26)    // Clear NAK
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL4_SNAK                 (0x1 << 27)    // Set NAK
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL4_SD0PID_SEVNFRM       (0x1 << 28)    // Set DATA0 PID
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL4_SODDFRM              (0x1 << 29)    // Set odd frame
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL4_EPDIS                (0x1 << 30)    // Endpoint disable
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL4_EPENA                (0x1 << 31)    // Endpoint enable
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL5_MPSIZ                (0x7ff << 0)    // Maximum packet size
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL5_USBAEP               (0x1 << 15)    // USB active endpoint
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL5_EONUM_DPID           (0x1 << 16)    // Even/odd frame
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL5_NAKSTS               (0x1 << 17)    // NAK status
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL5_EPTYP                (0x3 << 18)    // Endpoint type
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL5_Stall                (0x1 << 21)    // STALL handshake
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL5_TXFNUM               (0xf << 22)    // TxFIFO number
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL5_CNAK                 (0x1 << 26)    // Clear NAK
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL5_SNAK                 (0x1 << 27)    // Set NAK
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL5_SD0PID_SEVNFRM       (0x1 << 28)    // Set DATA0 PID
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL5_SODDFRM              (0x1 << 29)    // Set odd frame
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL5_EPDIS                (0x1 << 30)    // Endpoint disable
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL5_EPENA                (0x1 << 31)    // Endpoint enable
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL6_MPSIZ                (0x7ff << 0)    // Maximum packet size
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL6_USBAEP               (0x1 << 15)    // USB active endpoint
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL6_EONUM_DPID           (0x1 << 16)    // Even/odd frame
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL6_NAKSTS               (0x1 << 17)    // NAK status
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL6_EPTYP                (0x3 << 18)    // Endpoint type
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL6_Stall                (0x1 << 21)    // STALL handshake
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL6_TXFNUM               (0xf << 22)    // TxFIFO number
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL6_CNAK                 (0x1 << 26)    // Clear NAK
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL6_SNAK                 (0x1 << 27)    // Set NAK
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL6_SD0PID_SEVNFRM       (0x1 << 28)    // Set DATA0 PID
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL6_SODDFRM              (0x1 << 29)    // Set odd frame
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL6_EPDIS                (0x1 << 30)    // Endpoint disable
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL6_EPENA                (0x1 << 31)    // Endpoint enable
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL7_MPSIZ                (0x7ff << 0)    // Maximum packet size
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL7_USBAEP               (0x1 << 15)    // USB active endpoint
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL7_EONUM_DPID           (0x1 << 16)    // Even/odd frame
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL7_NAKSTS               (0x1 << 17)    // NAK status
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL7_EPTYP                (0x3 << 18)    // Endpoint type
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL7_Stall                (0x1 << 21)    // STALL handshake
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL7_TXFNUM               (0xf << 22)    // TxFIFO number
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL7_CNAK                 (0x1 << 26)    // Clear NAK
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL7_SNAK                 (0x1 << 27)    // Set NAK
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL7_SD0PID_SEVNFRM       (0x1 << 28)    // Set DATA0 PID
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL7_SODDFRM              (0x1 << 29)    // Set odd frame
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL7_EPDIS                (0x1 << 30)    // Endpoint disable
#define  _OTG_HS_DEVICE_OTG_HS_DIEPCTL7_EPENA                (0x1 << 31)    // Endpoint enable
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT0_XFRC                 (0x1 << 0)    // Transfer completed interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT0_EPDISD               (0x1 << 1)    // Endpoint disabled interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT0_TOC                  (0x1 << 3)    // Timeout condition
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT0_ITTXFE               (0x1 << 4)    // IN token received when TxFIFO is empty
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT0_INEPNE               (0x1 << 6)    // IN endpoint NAK effective
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT0_TXFE                 (0x1 << 7)    // Transmit FIFO empty
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT0_TXFIFOUDRN           (0x1 << 8)    // Transmit Fifo Underrun
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT0_BNA                  (0x1 << 9)    // Buffer not available interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT0_PKTDRPSTS            (0x1 << 11)    // Packet dropped status
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT0_BERR                 (0x1 << 12)    // Babble error interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT0_NAK                  (0x1 << 13)    // NAK interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT1_XFRC                 (0x1 << 0)    // Transfer completed interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT1_EPDISD               (0x1 << 1)    // Endpoint disabled interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT1_TOC                  (0x1 << 3)    // Timeout condition
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT1_ITTXFE               (0x1 << 4)    // IN token received when TxFIFO is empty
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT1_INEPNE               (0x1 << 6)    // IN endpoint NAK effective
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT1_TXFE                 (0x1 << 7)    // Transmit FIFO empty
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT1_TXFIFOUDRN           (0x1 << 8)    // Transmit Fifo Underrun
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT1_BNA                  (0x1 << 9)    // Buffer not available interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT1_PKTDRPSTS            (0x1 << 11)    // Packet dropped status
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT1_BERR                 (0x1 << 12)    // Babble error interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT1_NAK                  (0x1 << 13)    // NAK interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT2_XFRC                 (0x1 << 0)    // Transfer completed interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT2_EPDISD               (0x1 << 1)    // Endpoint disabled interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT2_TOC                  (0x1 << 3)    // Timeout condition
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT2_ITTXFE               (0x1 << 4)    // IN token received when TxFIFO is empty
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT2_INEPNE               (0x1 << 6)    // IN endpoint NAK effective
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT2_TXFE                 (0x1 << 7)    // Transmit FIFO empty
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT2_TXFIFOUDRN           (0x1 << 8)    // Transmit Fifo Underrun
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT2_BNA                  (0x1 << 9)    // Buffer not available interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT2_PKTDRPSTS            (0x1 << 11)    // Packet dropped status
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT2_BERR                 (0x1 << 12)    // Babble error interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT2_NAK                  (0x1 << 13)    // NAK interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT3_XFRC                 (0x1 << 0)    // Transfer completed interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT3_EPDISD               (0x1 << 1)    // Endpoint disabled interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT3_TOC                  (0x1 << 3)    // Timeout condition
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT3_ITTXFE               (0x1 << 4)    // IN token received when TxFIFO is empty
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT3_INEPNE               (0x1 << 6)    // IN endpoint NAK effective
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT3_TXFE                 (0x1 << 7)    // Transmit FIFO empty
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT3_TXFIFOUDRN           (0x1 << 8)    // Transmit Fifo Underrun
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT3_BNA                  (0x1 << 9)    // Buffer not available interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT3_PKTDRPSTS            (0x1 << 11)    // Packet dropped status
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT3_BERR                 (0x1 << 12)    // Babble error interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT3_NAK                  (0x1 << 13)    // NAK interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT4_XFRC                 (0x1 << 0)    // Transfer completed interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT4_EPDISD               (0x1 << 1)    // Endpoint disabled interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT4_TOC                  (0x1 << 3)    // Timeout condition
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT4_ITTXFE               (0x1 << 4)    // IN token received when TxFIFO is empty
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT4_INEPNE               (0x1 << 6)    // IN endpoint NAK effective
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT4_TXFE                 (0x1 << 7)    // Transmit FIFO empty
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT4_TXFIFOUDRN           (0x1 << 8)    // Transmit Fifo Underrun
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT4_BNA                  (0x1 << 9)    // Buffer not available interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT4_PKTDRPSTS            (0x1 << 11)    // Packet dropped status
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT4_BERR                 (0x1 << 12)    // Babble error interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT4_NAK                  (0x1 << 13)    // NAK interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT5_XFRC                 (0x1 << 0)    // Transfer completed interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT5_EPDISD               (0x1 << 1)    // Endpoint disabled interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT5_TOC                  (0x1 << 3)    // Timeout condition
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT5_ITTXFE               (0x1 << 4)    // IN token received when TxFIFO is empty
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT5_INEPNE               (0x1 << 6)    // IN endpoint NAK effective
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT5_TXFE                 (0x1 << 7)    // Transmit FIFO empty
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT5_TXFIFOUDRN           (0x1 << 8)    // Transmit Fifo Underrun
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT5_BNA                  (0x1 << 9)    // Buffer not available interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT5_PKTDRPSTS            (0x1 << 11)    // Packet dropped status
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT5_BERR                 (0x1 << 12)    // Babble error interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT5_NAK                  (0x1 << 13)    // NAK interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT6_XFRC                 (0x1 << 0)    // Transfer completed interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT6_EPDISD               (0x1 << 1)    // Endpoint disabled interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT6_TOC                  (0x1 << 3)    // Timeout condition
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT6_ITTXFE               (0x1 << 4)    // IN token received when TxFIFO is empty
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT6_INEPNE               (0x1 << 6)    // IN endpoint NAK effective
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT6_TXFE                 (0x1 << 7)    // Transmit FIFO empty
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT6_TXFIFOUDRN           (0x1 << 8)    // Transmit Fifo Underrun
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT6_BNA                  (0x1 << 9)    // Buffer not available interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT6_PKTDRPSTS            (0x1 << 11)    // Packet dropped status
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT6_BERR                 (0x1 << 12)    // Babble error interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT6_NAK                  (0x1 << 13)    // NAK interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT7_XFRC                 (0x1 << 0)    // Transfer completed interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT7_EPDISD               (0x1 << 1)    // Endpoint disabled interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT7_TOC                  (0x1 << 3)    // Timeout condition
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT7_ITTXFE               (0x1 << 4)    // IN token received when TxFIFO is empty
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT7_INEPNE               (0x1 << 6)    // IN endpoint NAK effective
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT7_TXFE                 (0x1 << 7)    // Transmit FIFO empty
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT7_TXFIFOUDRN           (0x1 << 8)    // Transmit Fifo Underrun
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT7_BNA                  (0x1 << 9)    // Buffer not available interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT7_PKTDRPSTS            (0x1 << 11)    // Packet dropped status
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT7_BERR                 (0x1 << 12)    // Babble error interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DIEPINT7_NAK                  (0x1 << 13)    // NAK interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DIEPTSIZ0_XFRSIZ              (0x7f << 0)    // Transfer size
#define  _OTG_HS_DEVICE_OTG_HS_DIEPTSIZ0_PKTCNT              (0x3 << 19)    // Packet count
#define  _OTG_HS_DEVICE_OTG_HS_DIEPDMA1_DMAADDR              (0xffffffff << 0)    // DMA address
#define  _OTG_HS_DEVICE_OTG_HS_DIEPDMA2_DMAADDR              (0xffffffff << 0)    // DMA address
#define  _OTG_HS_DEVICE_OTG_HS_DIEPDMA3_DMAADDR              (0xffffffff << 0)    // DMA address
#define  _OTG_HS_DEVICE_OTG_HS_DIEPDMA4_DMAADDR              (0xffffffff << 0)    // DMA address
#define  _OTG_HS_DEVICE_OTG_HS_DIEPDMA5_DMAADDR              (0xffffffff << 0)    // DMA address
#define  _OTG_HS_DEVICE_OTG_HS_DTXFSTS0_INEPTFSAV            (0xffff << 0)    // IN endpoint TxFIFO space avail
#define  _OTG_HS_DEVICE_OTG_HS_DTXFSTS1_INEPTFSAV            (0xffff << 0)    // IN endpoint TxFIFO space avail
#define  _OTG_HS_DEVICE_OTG_HS_DTXFSTS2_INEPTFSAV            (0xffff << 0)    // IN endpoint TxFIFO space avail
#define  _OTG_HS_DEVICE_OTG_HS_DTXFSTS3_INEPTFSAV            (0xffff << 0)    // IN endpoint TxFIFO space avail
#define  _OTG_HS_DEVICE_OTG_HS_DTXFSTS4_INEPTFSAV            (0xffff << 0)    // IN endpoint TxFIFO space avail
#define  _OTG_HS_DEVICE_OTG_HS_DTXFSTS5_INEPTFSAV            (0xffff << 0)    // IN endpoint TxFIFO space avail
#define  _OTG_HS_DEVICE_OTG_HS_DIEPTSIZ1_XFRSIZ              (0x7ffff << 0)    // Transfer size
#define  _OTG_HS_DEVICE_OTG_HS_DIEPTSIZ1_PKTCNT              (0x3ff << 19)    // Packet count
#define  _OTG_HS_DEVICE_OTG_HS_DIEPTSIZ1_MCNT                (0x3 << 29)    // Multi count
#define  _OTG_HS_DEVICE_OTG_HS_DIEPTSIZ2_XFRSIZ              (0x7ffff << 0)    // Transfer size
#define  _OTG_HS_DEVICE_OTG_HS_DIEPTSIZ2_PKTCNT              (0x3ff << 19)    // Packet count
#define  _OTG_HS_DEVICE_OTG_HS_DIEPTSIZ2_MCNT                (0x3 << 29)    // Multi count
#define  _OTG_HS_DEVICE_OTG_HS_DIEPTSIZ3_XFRSIZ              (0x7ffff << 0)    // Transfer size
#define  _OTG_HS_DEVICE_OTG_HS_DIEPTSIZ3_PKTCNT              (0x3ff << 19)    // Packet count
#define  _OTG_HS_DEVICE_OTG_HS_DIEPTSIZ3_MCNT                (0x3 << 29)    // Multi count
#define  _OTG_HS_DEVICE_OTG_HS_DIEPTSIZ4_XFRSIZ              (0x7ffff << 0)    // Transfer size
#define  _OTG_HS_DEVICE_OTG_HS_DIEPTSIZ4_PKTCNT              (0x3ff << 19)    // Packet count
#define  _OTG_HS_DEVICE_OTG_HS_DIEPTSIZ4_MCNT                (0x3 << 29)    // Multi count
#define  _OTG_HS_DEVICE_OTG_HS_DIEPTSIZ5_XFRSIZ              (0x7ffff << 0)    // Transfer size
#define  _OTG_HS_DEVICE_OTG_HS_DIEPTSIZ5_PKTCNT              (0x3ff << 19)    // Packet count
#define  _OTG_HS_DEVICE_OTG_HS_DIEPTSIZ5_MCNT                (0x3 << 29)    // Multi count
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL0_MPSIZ                (0x3 << 0)    // Maximum packet size
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL0_USBAEP               (0x1 << 15)    // USB active endpoint
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL0_NAKSTS               (0x1 << 17)    // NAK status
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL0_EPTYP                (0x3 << 18)    // Endpoint type
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL0_SNPM                 (0x1 << 20)    // Snoop mode
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL0_Stall                (0x1 << 21)    // STALL handshake
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL0_CNAK                 (0x1 << 26)    // Clear NAK
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL0_SNAK                 (0x1 << 27)    // Set NAK
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL0_EPDIS                (0x1 << 30)    // Endpoint disable
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL0_EPENA                (0x1 << 31)    // Endpoint enable
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL1_MPSIZ                (0x7ff << 0)    // Maximum packet size
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL1_USBAEP               (0x1 << 15)    // USB active endpoint
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL1_EONUM_DPID           (0x1 << 16)    // Even odd frame/Endpoint data PID
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL1_NAKSTS               (0x1 << 17)    // NAK status
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL1_EPTYP                (0x3 << 18)    // Endpoint type
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL1_SNPM                 (0x1 << 20)    // Snoop mode
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL1_Stall                (0x1 << 21)    // STALL handshake
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL1_CNAK                 (0x1 << 26)    // Clear NAK
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL1_SNAK                 (0x1 << 27)    // Set NAK
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL1_SD0PID_SEVNFRM       (0x1 << 28)    // Set DATA0 PID/Set even frame
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL1_SODDFRM              (0x1 << 29)    // Set odd frame
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL1_EPDIS                (0x1 << 30)    // Endpoint disable
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL1_EPENA                (0x1 << 31)    // Endpoint enable
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL2_MPSIZ                (0x7ff << 0)    // Maximum packet size
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL2_USBAEP               (0x1 << 15)    // USB active endpoint
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL2_EONUM_DPID           (0x1 << 16)    // Even odd frame/Endpoint data PID
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL2_NAKSTS               (0x1 << 17)    // NAK status
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL2_EPTYP                (0x3 << 18)    // Endpoint type
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL2_SNPM                 (0x1 << 20)    // Snoop mode
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL2_Stall                (0x1 << 21)    // STALL handshake
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL2_CNAK                 (0x1 << 26)    // Clear NAK
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL2_SNAK                 (0x1 << 27)    // Set NAK
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL2_SD0PID_SEVNFRM       (0x1 << 28)    // Set DATA0 PID/Set even frame
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL2_SODDFRM              (0x1 << 29)    // Set odd frame
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL2_EPDIS                (0x1 << 30)    // Endpoint disable
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL2_EPENA                (0x1 << 31)    // Endpoint enable
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL3_MPSIZ                (0x7ff << 0)    // Maximum packet size
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL3_USBAEP               (0x1 << 15)    // USB active endpoint
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL3_EONUM_DPID           (0x1 << 16)    // Even odd frame/Endpoint data PID
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL3_NAKSTS               (0x1 << 17)    // NAK status
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL3_EPTYP                (0x3 << 18)    // Endpoint type
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL3_SNPM                 (0x1 << 20)    // Snoop mode
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL3_Stall                (0x1 << 21)    // STALL handshake
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL3_CNAK                 (0x1 << 26)    // Clear NAK
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL3_SNAK                 (0x1 << 27)    // Set NAK
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL3_SD0PID_SEVNFRM       (0x1 << 28)    // Set DATA0 PID/Set even frame
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL3_SODDFRM              (0x1 << 29)    // Set odd frame
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL3_EPDIS                (0x1 << 30)    // Endpoint disable
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL3_EPENA                (0x1 << 31)    // Endpoint enable
#define  _OTG_HS_DEVICE_OTG_HS_DOEPINT0_XFRC                 (0x1 << 0)    // Transfer completed interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DOEPINT0_EPDISD               (0x1 << 1)    // Endpoint disabled interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DOEPINT0_STUP                 (0x1 << 3)    // SETUP phase done
#define  _OTG_HS_DEVICE_OTG_HS_DOEPINT0_OTEPDIS              (0x1 << 4)    // OUT token received when endpoint disabled
#define  _OTG_HS_DEVICE_OTG_HS_DOEPINT0_B2BSTUP              (0x1 << 6)    // Back-to-back SETUP packets received
#define  _OTG_HS_DEVICE_OTG_HS_DOEPINT0_NYET                 (0x1 << 14)    // NYET interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DOEPINT1_XFRC                 (0x1 << 0)    // Transfer completed interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DOEPINT1_EPDISD               (0x1 << 1)    // Endpoint disabled interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DOEPINT1_STUP                 (0x1 << 3)    // SETUP phase done
#define  _OTG_HS_DEVICE_OTG_HS_DOEPINT1_OTEPDIS              (0x1 << 4)    // OUT token received when endpoint disabled
#define  _OTG_HS_DEVICE_OTG_HS_DOEPINT1_B2BSTUP              (0x1 << 6)    // Back-to-back SETUP packets received
#define  _OTG_HS_DEVICE_OTG_HS_DOEPINT1_NYET                 (0x1 << 14)    // NYET interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DOEPINT2_XFRC                 (0x1 << 0)    // Transfer completed interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DOEPINT2_EPDISD               (0x1 << 1)    // Endpoint disabled interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DOEPINT2_STUP                 (0x1 << 3)    // SETUP phase done
#define  _OTG_HS_DEVICE_OTG_HS_DOEPINT2_OTEPDIS              (0x1 << 4)    // OUT token received when endpoint disabled
#define  _OTG_HS_DEVICE_OTG_HS_DOEPINT2_B2BSTUP              (0x1 << 6)    // Back-to-back SETUP packets received
#define  _OTG_HS_DEVICE_OTG_HS_DOEPINT2_NYET                 (0x1 << 14)    // NYET interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DOEPINT3_XFRC                 (0x1 << 0)    // Transfer completed interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DOEPINT3_EPDISD               (0x1 << 1)    // Endpoint disabled interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DOEPINT3_STUP                 (0x1 << 3)    // SETUP phase done
#define  _OTG_HS_DEVICE_OTG_HS_DOEPINT3_OTEPDIS              (0x1 << 4)    // OUT token received when endpoint disabled
#define  _OTG_HS_DEVICE_OTG_HS_DOEPINT3_B2BSTUP              (0x1 << 6)    // Back-to-back SETUP packets received
#define  _OTG_HS_DEVICE_OTG_HS_DOEPINT3_NYET                 (0x1 << 14)    // NYET interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DOEPINT4_XFRC                 (0x1 << 0)    // Transfer completed interrupt
