7h3qu1rkyb1t/stm32f7-drivers/drivers/inc/stm32f767xx_USB_OTG_HS.h
#define  _OTG_HS_DEVICE_OTG_HS_DOEPINT4_EPDISD               (0x1 << 1)    // Endpoint disabled interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DOEPINT4_STUP                 (0x1 << 3)    // SETUP phase done
#define  _OTG_HS_DEVICE_OTG_HS_DOEPINT4_OTEPDIS              (0x1 << 4)    // OUT token received when endpoint disabled
#define  _OTG_HS_DEVICE_OTG_HS_DOEPINT4_B2BSTUP              (0x1 << 6)    // Back-to-back SETUP packets received
#define  _OTG_HS_DEVICE_OTG_HS_DOEPINT4_NYET                 (0x1 << 14)    // NYET interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DOEPINT5_XFRC                 (0x1 << 0)    // Transfer completed interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DOEPINT5_EPDISD               (0x1 << 1)    // Endpoint disabled interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DOEPINT5_STUP                 (0x1 << 3)    // SETUP phase done
#define  _OTG_HS_DEVICE_OTG_HS_DOEPINT5_OTEPDIS              (0x1 << 4)    // OUT token received when endpoint disabled
#define  _OTG_HS_DEVICE_OTG_HS_DOEPINT5_B2BSTUP              (0x1 << 6)    // Back-to-back SETUP packets received
#define  _OTG_HS_DEVICE_OTG_HS_DOEPINT5_NYET                 (0x1 << 14)    // NYET interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DOEPINT6_XFRC                 (0x1 << 0)    // Transfer completed interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DOEPINT6_EPDISD               (0x1 << 1)    // Endpoint disabled interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DOEPINT6_STUP                 (0x1 << 3)    // SETUP phase done
#define  _OTG_HS_DEVICE_OTG_HS_DOEPINT6_OTEPDIS              (0x1 << 4)    // OUT token received when endpoint disabled
#define  _OTG_HS_DEVICE_OTG_HS_DOEPINT6_B2BSTUP              (0x1 << 6)    // Back-to-back SETUP packets received
#define  _OTG_HS_DEVICE_OTG_HS_DOEPINT6_NYET                 (0x1 << 14)    // NYET interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DOEPINT7_XFRC                 (0x1 << 0)    // Transfer completed interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DOEPINT7_EPDISD               (0x1 << 1)    // Endpoint disabled interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DOEPINT7_STUP                 (0x1 << 3)    // SETUP phase done
#define  _OTG_HS_DEVICE_OTG_HS_DOEPINT7_OTEPDIS              (0x1 << 4)    // OUT token received when endpoint disabled
#define  _OTG_HS_DEVICE_OTG_HS_DOEPINT7_B2BSTUP              (0x1 << 6)    // Back-to-back SETUP packets received
#define  _OTG_HS_DEVICE_OTG_HS_DOEPINT7_NYET                 (0x1 << 14)    // NYET interrupt
#define  _OTG_HS_DEVICE_OTG_HS_DOEPTSIZ0_XFRSIZ              (0x7f << 0)    // Transfer size
#define  _OTG_HS_DEVICE_OTG_HS_DOEPTSIZ0_PKTCNT              (0x1 << 19)    // Packet count
#define  _OTG_HS_DEVICE_OTG_HS_DOEPTSIZ0_STUPCNT             (0x3 << 29)    // SETUP packet count
#define  _OTG_HS_DEVICE_OTG_HS_DOEPTSIZ1_XFRSIZ              (0x7ffff << 0)    // Transfer size
#define  _OTG_HS_DEVICE_OTG_HS_DOEPTSIZ1_PKTCNT              (0x3ff << 19)    // Packet count
#define  _OTG_HS_DEVICE_OTG_HS_DOEPTSIZ1_RXDPID_STUPCNT      (0x3 << 29)    // Received data PID/SETUP packet count
#define  _OTG_HS_DEVICE_OTG_HS_DOEPTSIZ2_XFRSIZ              (0x7ffff << 0)    // Transfer size
#define  _OTG_HS_DEVICE_OTG_HS_DOEPTSIZ2_PKTCNT              (0x3ff << 19)    // Packet count
#define  _OTG_HS_DEVICE_OTG_HS_DOEPTSIZ2_RXDPID_STUPCNT      (0x3 << 29)    // Received data PID/SETUP packet count
#define  _OTG_HS_DEVICE_OTG_HS_DOEPTSIZ3_XFRSIZ              (0x7ffff << 0)    // Transfer size
#define  _OTG_HS_DEVICE_OTG_HS_DOEPTSIZ3_PKTCNT              (0x3ff << 19)    // Packet count
#define  _OTG_HS_DEVICE_OTG_HS_DOEPTSIZ3_RXDPID_STUPCNT      (0x3 << 29)    // Received data PID/SETUP packet count
#define  _OTG_HS_DEVICE_OTG_HS_DOEPTSIZ4_XFRSIZ              (0x7ffff << 0)    // Transfer size
#define  _OTG_HS_DEVICE_OTG_HS_DOEPTSIZ4_PKTCNT              (0x3ff << 19)    // Packet count
#define  _OTG_HS_DEVICE_OTG_HS_DOEPTSIZ4_RXDPID_STUPCNT      (0x3 << 29)    // Received data PID/SETUP packet count
#define  _OTG_HS_DEVICE_OTG_HS_DIEPTSIZ6_XFRSIZ              (0x7ffff << 0)    // Transfer size
#define  _OTG_HS_DEVICE_OTG_HS_DIEPTSIZ6_PKTCNT              (0x3ff << 19)    // Packet count
#define  _OTG_HS_DEVICE_OTG_HS_DIEPTSIZ6_MCNT                (0x3 << 29)    // Multi count
#define  _OTG_HS_DEVICE_OTG_HS_DTXFSTS6_INEPTFSAV            (0xffff << 0)    // IN endpoint TxFIFO space avail
#define  _OTG_HS_DEVICE_OTG_HS_DIEPTSIZ7_XFRSIZ              (0x7ffff << 0)    // Transfer size
#define  _OTG_HS_DEVICE_OTG_HS_DIEPTSIZ7_PKTCNT              (0x3ff << 19)    // Packet count
#define  _OTG_HS_DEVICE_OTG_HS_DIEPTSIZ7_MCNT                (0x3 << 29)    // Multi count
#define  _OTG_HS_DEVICE_OTG_HS_DTXFSTS7_INEPTFSAV            (0xffff << 0)    // IN endpoint TxFIFO space avail
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL4_MPSIZ                (0x7ff << 0)    // Maximum packet size
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL4_USBAEP               (0x1 << 15)    // USB active endpoint
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL4_EONUM_DPID           (0x1 << 16)    // Even odd frame/Endpoint data PID
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL4_NAKSTS               (0x1 << 17)    // NAK status
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL4_EPTYP                (0x3 << 18)    // Endpoint type
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL4_SNPM                 (0x1 << 20)    // Snoop mode
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL4_Stall                (0x1 << 21)    // STALL handshake
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL4_CNAK                 (0x1 << 26)    // Clear NAK
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL4_SNAK                 (0x1 << 27)    // Set NAK
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL4_SD0PID_SEVNFRM       (0x1 << 28)    // Set DATA0 PID/Set even frame
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL4_SODDFRM              (0x1 << 29)    // Set odd frame
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL4_EPDIS                (0x1 << 30)    // Endpoint disable
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL4_EPENA                (0x1 << 31)    // Endpoint enable
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL5_MPSIZ                (0x7ff << 0)    // Maximum packet size
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL5_USBAEP               (0x1 << 15)    // USB active endpoint
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL5_EONUM_DPID           (0x1 << 16)    // Even odd frame/Endpoint data PID
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL5_NAKSTS               (0x1 << 17)    // NAK status
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL5_EPTYP                (0x3 << 18)    // Endpoint type
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL5_SNPM                 (0x1 << 20)    // Snoop mode
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL5_Stall                (0x1 << 21)    // STALL handshake
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL5_CNAK                 (0x1 << 26)    // Clear NAK
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL5_SNAK                 (0x1 << 27)    // Set NAK
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL5_SD0PID_SEVNFRM       (0x1 << 28)    // Set DATA0 PID/Set even frame
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL5_SODDFRM              (0x1 << 29)    // Set odd frame
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL5_EPDIS                (0x1 << 30)    // Endpoint disable
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL5_EPENA                (0x1 << 31)    // Endpoint enable
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL6_MPSIZ                (0x7ff << 0)    // Maximum packet size
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL6_USBAEP               (0x1 << 15)    // USB active endpoint
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL6_EONUM_DPID           (0x1 << 16)    // Even odd frame/Endpoint data PID
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL6_NAKSTS               (0x1 << 17)    // NAK status
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL6_EPTYP                (0x3 << 18)    // Endpoint type
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL6_SNPM                 (0x1 << 20)    // Snoop mode
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL6_Stall                (0x1 << 21)    // STALL handshake
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL6_CNAK                 (0x1 << 26)    // Clear NAK
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL6_SNAK                 (0x1 << 27)    // Set NAK
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL6_SD0PID_SEVNFRM       (0x1 << 28)    // Set DATA0 PID/Set even frame
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL6_SODDFRM              (0x1 << 29)    // Set odd frame
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL6_EPDIS                (0x1 << 30)    // Endpoint disable
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL6_EPENA                (0x1 << 31)    // Endpoint enable
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL7_MPSIZ                (0x7ff << 0)    // Maximum packet size
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL7_USBAEP               (0x1 << 15)    // USB active endpoint
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL7_EONUM_DPID           (0x1 << 16)    // Even odd frame/Endpoint data PID
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL7_NAKSTS               (0x1 << 17)    // NAK status
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL7_EPTYP                (0x3 << 18)    // Endpoint type
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL7_SNPM                 (0x1 << 20)    // Snoop mode
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL7_Stall                (0x1 << 21)    // STALL handshake
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL7_CNAK                 (0x1 << 26)    // Clear NAK
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL7_SNAK                 (0x1 << 27)    // Set NAK
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL7_SD0PID_SEVNFRM       (0x1 << 28)    // Set DATA0 PID/Set even frame
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL7_SODDFRM              (0x1 << 29)    // Set odd frame
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL7_EPDIS                (0x1 << 30)    // Endpoint disable
#define  _OTG_HS_DEVICE_OTG_HS_DOEPCTL7_EPENA                (0x1 << 31)    // Endpoint enable
#define  _OTG_HS_DEVICE_OTG_HS_DOEPTSIZ5_XFRSIZ              (0x7ffff << 0)    // Transfer size
#define  _OTG_HS_DEVICE_OTG_HS_DOEPTSIZ5_PKTCNT              (0x3ff << 19)    // Packet count
#define  _OTG_HS_DEVICE_OTG_HS_DOEPTSIZ5_RXDPID_STUPCNT      (0x3 << 29)    // Received data PID/SETUP packet count
#define  _OTG_HS_DEVICE_OTG_HS_DOEPTSIZ6_XFRSIZ              (0x7ffff << 0)    // Transfer size
#define  _OTG_HS_DEVICE_OTG_HS_DOEPTSIZ6_PKTCNT              (0x3ff << 19)    // Packet count
#define  _OTG_HS_DEVICE_OTG_HS_DOEPTSIZ6_RXDPID_STUPCNT      (0x3 << 29)    // Received data PID/SETUP packet count
#define  _OTG_HS_DEVICE_OTG_HS_DOEPTSIZ7_XFRSIZ              (0x7ffff << 0)    // Transfer size
#define  _OTG_HS_DEVICE_OTG_HS_DOEPTSIZ7_PKTCNT              (0x3ff << 19)    // Packet count
#define  _OTG_HS_DEVICE_OTG_HS_DOEPTSIZ7_RXDPID_STUPCNT      (0x3 << 29)    // Received data PID/SETUP packet count
#define  _OTG_HS_PWRCLK_OTG_HS_PCGCR_STPPCLK                 (0x1 << 0)    // Stop PHY clock
#define  _OTG_HS_PWRCLK_OTG_HS_PCGCR_GATEHCLK                (0x1 << 1)    // Gate HCLK
#define  _OTG_HS_PWRCLK_OTG_HS_PCGCR_PHYSUSP                 (0x1 << 4)    // PHY suspended
